[
{
  "term": "totem",
  "lang": "es",
  "definition": "emblema de una familia o tribu; puede incluir un objeto natural, un animal o un espíritu",
  "notes": [
    "En las tribus australianas, un tótem es un animal, domestico o no, más raramente una planta, que se identifica con la tribu. Los individuos que tienen el mismo tótem deben respetar su vida y abstenerse de comer su carne. Los miembros de un mismo tótem no deben tener relaciones sexuales.",
    "la palabra tótem popularizó tras la publicación por Sigmund Freud del libro \"Tótem y tabú\" en 1912, donde se establecía una similitud entre la psicología de los pueblos primitivos y la de los enfermos con neurosis."
  ]
},
{
  "term": "clan",
  "lang": "es",
  "definition": "familia numerosa, un grupo de personas de ascendencia común o un grupo de familias muy unidas e interrelacionadas",
  "notes": []
},

{
  "term": "tribu",
  "lang": "es",
  "definition": "grupo social primitivo de un mismo origen, real o supuesto, cuyos miembros suelen tener en común usos y costumbres",
  "notes": []
},
{
  "term": "nación",
  "lang": "es",
  "definition": "conjunto de los habitantes de un país regido por el mismo Gobierno",
  "notes": [
    "también puede referirse a un grupo de personas que comparten una historia, tradiciones, cultura y, a menudo, un idioma, incluso si el grupo no posee un territorio político propio"
  ]
},
{
  "term": "pueblo",
  "lang": "es",
  "definition": "conjunto de habitantes de un territorio, unidos por vínculos políticos o culturales",
  "examples": [
    "El pueblo andaluz.",
    "El pueblo nicaragüense.",
    "El pueblo judío."
  ],
  "notes": [
    "también, conjunto de personas que tienen un origen étnico común"
  ]
},
{
  "term": "etnia",
  "lang": "es",
  "definition": "características sociales y culturales, la procedencia o las experiencias compartidas por un grupo de personas; esto abarca aspectos como el idioma, la religión, las creencias, los valores y los comportamientos que suelen pasar de una generación a la siguiente",
  "notes": []
},

{
  "term": "cresta",
  "lang": "es",
  "definition": "emblema o diseño formal utilizado como símbolo para representar una familia, pueblo, grupo u organización. Para muchas tribus de la costa noroeste del Pacífico, la cresta representa una entidad con la cual el clan afirma tener una relación significativa",
  "notes": []
},

{
  "term": "potlach",
  "lang": "es",
  "definition": "ceremonia para conmemorar eventos importantes en la vida del anfitrión, tales como un matrimonio, el nacimiento y nombramiento de un niño, el duelo de un fallecido, un nuevo rango social y la transferencia de derechos; estas ceremonias a menudo incluían muchos invitados, discursos, banquetes, regalos y presentaciones de baile",
  "notes": []
},


{
  "term": "género",
  "field": "orientación sexual"
  "lang": "es",
  "definition": "",
  "notes": []
},

{
  "term": "asexual",
  "field": "orientación sexual"
  "lang": "es",
  "definition": "",
  "notes": []
},
{
  "term": "orientación sexual",
  "lang": "es",
  "definition": "",
  "notes": []
},

{
  "term": "cultura",
  "lang": "es",
  "definition": "",
  "notes": []
},

{
  "term": "difusionismo",
  "field": "cultura",
  "lang": "es",
  "definition": "",
  "notes": []
},

{
  "term": "funcionalismo",
  "lang": "es",
  "field": "cultura",
  "definition": "",
  "notes": []
},

{
  "term": "animismo",
  "lang": "es",
  "field": "antropología cultural",
  "definition": "creencia que atribuye vida, intencionalidad, voluntad o sentimientos parecidos a los del hombre a todos los objetos de la naturaleza",
  "notes": [
    "el animismo es una forma de antropocentrismo"
  ]
},

{
  "term": "antropocentrismo",
  "lang": "es",
  "definition": "",
  "notes": []
},

{
  "term": "antropología",
  "lang": "es",
  "definition": "",
  "notes": []
},

{
  "term": "cyberpunk",
  "lang": "en",
  "field": "literary genre",
  "definition": "a subgenre of science fiction in a dystopian futuristic setting said to focus on a combination of \"low-life and high tech\"; it features futuristic technological and scientific achievements, such as artificial intelligence and cyberware, juxtaposed with societal collapse, dystopia or decay",
  "authors": [
    " William Gibson",
    "Bruce Sterling",
    "Pat Cadigan"
  ],
  "notes": []
}

]
