[
{
  "term": "entropy",
  "lang": "en",
  "field": "science",
  "subfield": "thermodynamics",
  "definition": "a concept that measures the randomness, disorder, or uncertainty in a system, also defined as the amount of thermal energy unavailable to do work",
  "notes": [
    "central to the second law of thermodynamics, which states that the entropy of an isolated system never decreases over time, meaning that systems naturally evolve toward a state of maximum disorder or equilibrium"
  ]
},
{
  "name": "férula extensora activa",
  "lang": "es",
  "field": "medicine",
  "description": null
},
{
  "term": "Internet of Things",
  "lang": "en",
  "field": "technology",
  "definition": "a network of connected things and people, all of which share data about the way they are used and their environments",
  "instances": [
    "appliances",
    "sensors",
    "televisions",
    "routers",
    "printers"
  ]
},
{
  "term": "bioremediation (of contaminated soils)",
  "lang": "en",
  "field": "ecology",
  "definition": ""
},
{
  "term": "biomedicine",
  "lang": "en",
  "field": "health",
  "definition": ""
},
{
  "term": "eutrophication",
  "lang": "en",
  "field": "ecology",
  "definition": "excessive richness of nutrients in a lake or other body of water, frequently due to run-off from the land, which causes a dense growth of plant life",
  "causes": [
    {"name": "agricultural runoff", "discussion": "fertilizers containing nitrogen and phosphorus are washed into waterways"},
    {"name": "sewage and septic systems", "discussion": "discharge of wastewater can be high in nutrients"},
    {"name": "industrial waste", "discussion": "some industrial processes release nutrient-rich waste"},
    {"name": "animal waste", "discussion": "runoff from farms containing animal waste adds to the nutrient load"}
  ]
},
{
  "term": "algal bloom",
  "lang": "en",
  "field": "ecology",
  "definition": "rapid growth of algae and aquatic plants, which block sunlight from reaching lower plants",
  "notes": [
    "when these blooms decompose, bacteria consume the available oxygen, creating hypoxic or \"dead\" zones where fish and other aquatic life cannot survive"
  ]
},
{
  "term": "slurry",
  "lang": "en",
  "field": "materials",
  "definition": "a semi-liquid mixture, typically of fine particles of manure, cement, or coal suspended in water"
},
{
  "name": "rebound effect",
  "lang": "en",
  "description": null
},
{
  "title": "The world is analog",
  "lang": "en",
  "discussion": null
},
{
  "term": "surveillance capitalism",
  "lang": "en",
  "field": "society",
  "definition": null,
  "discussion": null
},
{
  "name": "Javons Paradox",
  "lang": "en",
  "field": "economics",
  "description": "technological advancements increasing the efficiency of a resource can lead to an overall increase in its consumption, rather than a decrease (rebound effect)",
  "explanation": "the resource becomes cheaper to use, leading to higher demand that can outpace the efficiency gains, resulting in more total consumption",
  "examples": [
    "more efficient engines made coal cheaper to use, which led to coal being used in more industries and ultimately increased overall coal consumption",
    "more fuel-efficient cars lead to people driving more miles, increasing total fuel use",
    "better cybersecurity incentivates taking more risks, which could result in more breaches",
    "improvements in computing efficiency lead to proportional increases in demand for computing resources, ultimately balancing out the gains",
    "the more roads are built, the more people will drive, which could actually worsen congestion"
  ],
  "notes": [
    "the paradox occurs when this increased demand, driven by affordability, completely offsets or even exceeds the savings from the initial efficiency improvement"
  ]
},
{
  "name": "automation complacency",
  "lang": "en",
  "field": "psychology",
  "description": null
},
{
  "term": "the consumtariat",
  "lang": "en",
  "field": "society",
  "etymology": "a portmanteau of consumer and proletariat",
  "definition": "a new underclass whose main activity is consumption, regulated from above",
  "description": "kept occupied with private problems, its desires provoked with the use of advertisements and its active participation limited to things like product choice, product customization, engaging with interactive products and life-style choice",
  "originator": "Alexander Bard"
},
{ "term": "phase-separation",
  "lang": "en",
  "definition": "the process where a single, homogeneous mixture separates into two or more distinct, physically separate phases",
  "notes": [
    "this phenomenon is often induced through quenching",
    "historically, phase separation in glass was an unwanted defect, today, it is a controlled process used to create advanced materials"
  ]
},
{
  "term": "topological sort",
  "lang": "en",
  "field": "mathematics",
  "subfield": "graph theory",
  "definition": "in a directed acyclical graph (DAG), a traversal such that each node v is visited only after all its dependencies are visited",
  "instances": [
    "scheduling a sequence of jobs or tasks based on their dependencies",
    "logic synthesis",
    "determining the order of compilation tasks to perform in makefiles",
    "data serialization"
  ]
},
{
  "term": "total ordering",
  "lang": "en",
  "field": "mathematics",
  "definition": "on a set, whenever for each pair of elements a,b, either a < b, or a == b, or a > b",
  "notes": [
    "this is tantamount to saying that all elements are comparable"
  ]
},
{
  "term": "strict",
  "lang": "en",
  "field": "mathematics",
  "definition": "said about a mapping, whenever no element is mapped to itself",
  "instances": [
    {"name": "set inclusion",
     "discussion": "if set A is strictly included in set B, then they must be different"},
    {"name": "comparisons",
     "discussion": "a comparison, such as < (\"less than\"), is said to be strict if for all elements, no E < E"}
  ]
},
{
  "term": "strict partial ordering",
  "lang": "en",
  "field": "mathematics",
  "definition": "on a set, given any two elements x and y, x is never ordered before itself (strict), and x and y might be tied (neither x nor y may be ordered before the other, i.e. partial)",
  "instances": [
    {"name": "books",
     "discussion": "often enough a reader is persuaded that a book A is better than book B, yet uncertain as to whether B is better than, say, book C"},
    {"name": "people",
     "discussion": "for any two people A and B, sometimes it is clear to somebody that A is kinder (or wiser, or fitter) than B, sometimes it isn't clear at all"}
  ]
},
{
  "term": "strict weak ordering",
  "lang": "en",
  "field": "mathematics",
  "definition": "a restricted version of a strict partial order: if x is tied with y, and y is tied with z, x is also tied with z",
  "instances": [
    {"name": "time",
     "discussion": "events that are equivalent in a given timeframe happen at the same time"},
    {"name": "price",
     "discussion": "an item may cost the same as another, but it can also cost the same amount of money"}
  ]
},
{
  "term": "upcycling",
  "lang": "en",
  "field": "ecologism",
  "definition": "the creative reuse of waste or unwanted products to create new items of higher quality and value",
  "synonyms": ["creative reuse"],
  "notes": [
    "unlike conventional recycling, which breaks down materials into raw components, upcycling involves transforming an item without destroying its original material integrity"
  ],
  "instances": [
    "turning old pallets into furniture"
  ],
  "benefits": [
    "helps reduce waste",
    "conserves resources",
    "lowers environmental impact"
  ]
},
{
  "term": "essential-oil extract",
  "lang": "en",
  "definition": "an extract prepared by dissolving an essential oil in alcohol of the proper strength, and adding water",
  "instances": ["almond", "anise", "celery", "cassia/cinnamon", "clove", "lemon", "nutmeg", "orange", "rosemary", "savory", "basil", "sweet marjoram", "thyme", "wintergreen"]
},
{
  "title": "Use Edges and Value the Marginal",
  "lang": "en",
  "field": "systems",
  "subfield": "permaculture",
  "contents": ["Edges occur where two systems meet – think ecosystems, cultures, etc. At these meeting points, diversity increases as the elements of both systems converge and create entirely new elements that may not exist otherwise."]
},
{
  "term": "fintech",
  "lang": "en",
  "definition": "computer programs and other technology used to support or enable banking and financial services",
  "discussion": "Fintech, a blend of \"financial\" and \"technology,\" refers to the use of technology to deliver financial services and products in new ways. It encompasses a wide range of innovations, from mobile banking apps and digital payments to blockchain, artificial intelligence, and algorithmic trading. Essentially, it's technology-enabled innovation that changes how consumers and businesses access and manage their finances."
},
{
  "name": "humanists",
  "lang": "en",
  "description": [
    "Humanists are non-religious people who do not believe in a god. They believe that the world is a natural place, that human beings have natural origins, and that this is the one life we have. They believe it is possible to lead a good, happy, and meaningful life without religion.",
    "Humanists recognise that we have many different natural capacities and believe we have a responsibility to make the most of them to build a fairer and kinder society. We can ask and answer questions about the world around us. We can use empathy and imagination to consider how other people might feel, and think about how to treat them well. We can make choices about how we want to live and take action to improve our own lives and the lives of others. Humanists believe we should think about the consequences of our actions on other people and animals and try to promote happiness and wellbeing. They celebrate these human capacities and the way different people have used them to make the world a better place."
  ]
},




{
  "term": "biome",
  "lang": "en",
  "field": "biology",
  "subfield": "ecology",
  "definition": "major life zone"
},
{
  "term": "histosol",
  "lang": "en",
  "field": "biology",
  "subfield": "edaphology",
  "is-a": "soil",
  "definition": "",
  "description": null,
  "discussion": null
},
{
  "term": "inceptisol",
  "lang": "en",
  "field": "biology",
  "subfield": "edaphology",
  "is-a": "soil",
  "definition": "",
  "description": null,
  "discussion": null
},
{
  "term": "lichen",
  "lang": "en",
  "field": "biology",
  "definition": "a symbiotic association of a fungus and algae"

},

{
  "term": "taiga",
  "lang": "en",
  "field": "biology",
  "subfield": "ecology",
  "is-a": "biome",
  "description": [
    "composed primarily of cone-bearing needle-leaved or scale-leaved evergreen trees",
    "found in northern circumpolar forested regions characterized by long winters and moderate to high annual precipitation"
  ],
  "regions": [
    {"name": "closed-canopy forest",
     "description": [
       "the southernmost portion of the taiga",
       "contains the greatest richness of species, the warmest soils, the highest productivity, and the longest growing season within the boreal zone"
     ]
    },
    {"name": "lichen woodland",
     "synonyms": ["sparse taiga"],
     "description": [
       "a smaller parallel zone of sparse forest or woodland",
       "tree crowns do not form a closed canopy",
       "lichen mats and tundralike vegetation make up a significant portion of the ground cover"
     ]
    },
    {"name": "forest-tundra",
     "description": [
       "along the northern edge of tree growth (tree line)",
       "patches of trees consisting of only a few species dot restricted portions of the landscape, forming a complex mosaic with tundra",
       "many trees in the forest-tundra zone have never been known to produce viable seeds or have done so only sporadically. These trees were established during warmer climatic episodes from a few hundred to a few thousand years ago and have persisted since, usually by vegetative (asexual) reproduction"
     ]
    }
  ],
  "discussion": null,
  "notes": [
    "occupies about 17 percent of Earth’s land surface area in a circumpolar belt of the far Northern Hemisphere",
    "northward beyond, the taiga merges into the circumpolar tundra",
    "plants and animals in the taiga are adapted to short growing seasons of long days that vary from cool to warm",
    "hosts a limited number of conifer species—i.e., pine (Pinus), spruce (Picea), larch (Larix), fir (Abies)—and to a lesser degree by some deciduous genera such as birch (Betula) and poplar (Populus)",
    "during winter a snowpack persists for at least five months in the southern portion of the taiga biome and for seven or eight months in the northern reaches",
    "it has been estimated that Earth would be significantly colder without the taiga",
    "areas with a mean annual temperature below freezing are susceptible to the formation of permafrost soils"
  ]
},
{
  "term": "tundra",
  "lang": "en",
  "field": "biology",
  "subfield": "ecology",
  "is-a": "biome",
  "definition": [
  ],
  "discussion": null,
  "notes": []
},

{
  "term": "histeresis",
  "field": "electromagnetism",
  "definition": null,
  "instances": []
},
{
  "difference": ["instance", "example"],
  "discussion": [
    "an example is meant for illustrating or clarifying a point"
  ]
},
{
  "saying": "If opportunity doesn't knock, build a door",
  "lang": "en",
  "field": "",
  "keywords": ["chance", "proactive", "networking", "taking control"],
  "meaning": "One should not passively wait for opportunities to arise, but rather actively create them. It encourages taking initiative and being proactive in pursuing one's goals. This can involve developing skills, networking, and taking calculated risks. Ultimately, it's about taking control of one's destiny and not relying solely on chance.",
  "notes": []
},

{
  "term": "medidas universales de bastidores",
  "lang": "es",
  "field": "art",
  "subfield": "painting",
  "keywords": ["format", "painting", "standard"],
  "list": [],
  "notes": []
},
{
  "term": "projection",
  "lang": "en",
  "field": null,
  "keywords": ["set", "subset", "mapping"],
  "definition": "a mapping of a set into a subset of its",
  "notes": []
},
{
  "term": "wormhole",
  "lang": "en",
  "field": "physics",
  "subfield": "astrophysics",
  "keywords": ["relativity", "space-time"],
  "definition": "a theoretical passage or \"tunnel\" through space-time that could create shortcuts for long journeys across the universe",
  "notes": [
    "predicted by the theory of general relativity"
  ]
},

{
  "term": "reciprocal",
  "lang": "en",
  "field": null,
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "hierarchy",
  "lang": "en",
  "field": null,
  "keywords": [],
  "definition": "",
  "notes": []
},

{
  "term": "paradigm",
  "lang": "en",
  "definition": "an example or pattern; esp. an outstandingly clear or typical example",
  "instances": []
},
{
  "term": "fact sheet",
  "lang": "en",
  "definition": null,
  "instances": []
},
{
  "term": "normalcy",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "the state of being normal, usual, or expected; a return to a previous, familiar, and generally accepted condition, often after a period of disruption or abnormality",
  "notes": []
},
{
  "term": "accountable",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "eclecticism",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "syncretism",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "scepticism",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "pragmatism",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "comply",
  "lang": "en",
  "field": "general",
  "keywords": [],
  "definition": "",
  "notes": []
},

{
  "term": "utility",
  "lang": "en",
  "field": "economics",
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "flat rate",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},

{
  "name": "ASML",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "a Dutch multinational corporation that designs and manufactures photolithography systems used in the production of integrated circuits; a leading supplier to the semiconductor industry and the sole supplier of extreme ultraviolet (EUV) lithography machines",
  "notes": []
},
{
  "name": "agar",
  "synonyms": ["agar-agar"],
  "pronuciations": ["/ˈeɪɡɑːr/", "/ˈɑːɡər/"],
  "lang": "en",
  "field": "nutrition",
  "keywords": [],
  "definition": "a jelly-like substance consisting of polysaccharides obtained from the cell walls of some species of red algae, primarily from the Gracilaria genus (Irish moss, ogonori) and the Gelidiaceae family (tengusa)",
  "description": [
    "as found in nature, agar is a mixture of two components, the linear polysaccharide agarose and a heterogeneous mixture of smaller molecules called agaropectin"
  ],
  "notes": []
},
{
  "term": "chapuza",
  "lang": "es",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},
{
  "term": "lexicon",
  "lang": "en",
  "field": "",
  "keywords": [],
  "definition": "",
  "notes": []
},


{
  "term": "cyberpunk",
  "lang": "en",
  "field": "literature",
  "subfield": "sci-fi",
  "keywords": ["dystopian"],
  "subfield": "literary genre",
  "definition": "a subgenre of science fiction in a dystopian futuristic setting said to focus on a combination of \"low-life and high tech\"; it features futuristic technological and scientific achievements, such as artificial intelligence and cyberware, juxtaposed with societal collapse, dystopia or decay",
  "authors": [
    " William Gibson",
    "Bruce Sterling",
    "Pat Cadigan"
  ],
  "notes": []
},

{
  "term": "arsenic",
  "lang": "en",
  "field": "chemistry",
  "keywords": ["heavy metal", "poisonous"],
  "definition": "",
  "notes": []
},

{
  "term": "doomsday device",
  "lang": "en",
  "definition": "a hypothetical construction – usually a weapon or weapons system – which could destroy all life on a planet, particularly Earth, or destroy the planet itself",
  "notes": [
    "Most hypothetical constructions rely on hydrogen bombs being made arbitrarily large, assuming there are no concerns about delivering them to a target (see Teller–Ulam design) or that they can be \"salted\" with materials designed to create long-lasting and hazardous fallout (e.g., a cobalt bomb)"
  ],
  "instances": [
    {"name": "Sundial",    "yield": "10GT"},
    {"name": "Gnomon",     "yield":  "1GT"},
    {"name": "Tsar Bomba", "yield": "100MT"}
  ]
},
{
  "term": "othering",
  "lang": "en",
  "definition": "our tendency to cast people and groups in irreconcilable terms",
  "notes": [
  ],
  "instances": [
  ]
},
{
  "term": "template",
  "lang": "en",
  "definition": ""
},

{
  "term": "state of affairs",
  "lang": "en",
  "definition": ""
},
{
  "term": "fact",
  "lang": "en",
  "definition": "",
  "notes": [
    "translates poorly to idiomatic Spanish"
  ],
  "instances": [
    "The Earth orbits the Sun",
    "Morocco is predominantly muslim",
    "Spain has more on the order of 100,000 laws"
  ]
},
{
  "term": "inventio",
  "lang": "en",
  "field": "rhetoric",
  "definition": "the process of discovering and developing ideas, arguments, and evidence to support a particular claim or position",
  "instances": [
  ]
},
{
  "term": "scrapbook",
  "lang": "en",
  "field": null,
  "definition": "",
  "instances": [
  ]
},

{
  "term": "impedance",
  "lang": "en",
  "field": "systems",
  "definition": "",
  "instances": [
  ]
},
{
  "term": "entropy",
  "lang": "en",
  "field": "systems",
  "subfield": "thermodynamics",
  "definition": "a measure of the disorder or randomness of a system",
  "instances": [
  ]
},






{
  "term": "historicism",
  "lang": "en",
  "field": "culture",
  "definition": ""

},

{
  "term": "holistic",
  "lang": "en",
  "field": "culture",
  "definition": ""
},

{
  "term": "upcycling",
  "lang": "en",
  "field": "sustainability",
  "definition": ""
},
{
  "term": "downcycling",
  "lang": "en",
  "field": "sustainability",
  "definition": ""
},
{
  "term": "appropriate technology",
  "lang": "en",
  "definition": "",
  "instances": [
  ]
},

{
  "term": "monolithic",
  "lang": "en",
  "field": "systems",
  "definition": "",
  "opposite": "modular",
  "instances": []
},
{
  "term": "modular",
  "lang": "en",
  "field": "systems",
  "definition": "",
  "opposite": "monolithic",
  "instances": []
},
{
  "term": "yield",
  "lang": "en",
  "field": "systems",
  "definition": "",
  "instances": []
},
{
  "term": "theoretical limit",
  "lang": "en",
  "field": "systems",
  "definition": "",
  "instances": [
    {"name": "Betz limit",     "field": "windturbines"},
    {"name": "speed of light", "definition": "speed of light in vacuum"},
    {"name": "Shockley-", "field": "photosynthesis"},
    {"name": "Second Law", "field": "thermodynamics"}
  ]
},

{
  "name": "Silent Spring",
  "author": "Rachel Carson",
  "type": "book",
  "topic": "the extent of environmental damage caused by insecticides"
},
{
  "term": "tolerance",
  "lang": "en",
  "field": "engineering",
  "definition": "",
  "instances": []
},

{
  "term": "synergy",
  "lang": "en",
  "field": "systems",
  "definition": "",
  "instances": []
},




{
  "term": "makers",
  "field": "movement",
  "definition": "",
  "instances": []
},

{
  "term": "methodology",
  "lang": "en",
  "field": null,
  "definition": "a system of methods used in a particular area of study or activity",
  "instances": []
},
{
  "term": "futurism",
  "lang": "en",
  "field": ["art", "society"],
  "type": "movement",
  "definition": "an artistic and social movement that originated in Italy, and to a lesser extent in other countries, in the early 20th century",
  "values": [
    "dynamism",
    "speed",
    "technology",
    "youth",
    "violence",
    "objects such as the car, the airplane, and the industrial city"
  ],
  "origin": {"place": "Italy"},
  "time": "early 20th century",
  "notes": [
    "Many Italian Futurists supported Fascism in the hope of modernizing a country divided between the industrialising north and the rural, archaic South.",
    "Like the Fascists, the Futurists were Italian nationalists, laborers, disgruntled war veterans, radicals, admirers of violence, and opposed to parliamentary democracy"
  ],
  "figures": []
},
{
  "term": "Ten Thousand Hours",
  "lang": "en",
  "field": null,
  "definition": "ten thousand hours is the average number of hours across disciplines that research shows it takes to become an expert",
  "notes": [
    "based on research by Anders Ericsson",
    "popularized in Malcolm Gladwell’s book Outliers"
  ]
},
{
  "term": "dataism",
  "lang": "en",
  "field": null,
  "definition": "a concept that views the universe, including human beings, as systems processing data; it assumes that the value of everything is determined by its contribution to data processing; it sees data as the fundamental organizing principle of reality, with information flows as the primary driver of progress and understanding",
  "instances": [],
  "origin": {"name": "David Brooks", "year": 2013},
  "notes": [
    "it originates in the emerging significance of big data",
    "the term has been expanded to describe what historian Yuval Noah Harari, in his book Homo Deus: A Brief History of Tomorrow from 2015, calls an emerging ideology or even a new form of religion, in which \"information flow\" is the \"supreme value\""
  ]

},
{
  "term": "surveillance capitalism",
  "lang": "en",
  "field": "political economics",
  "definition": "the widespread collection and commodification of personal data by corporations",
  "notes": [
    "surveillance capitalism is considered distinct from government surveillance, although the two can be mutually reinforcing"
  ]
},
{
  "term": "surrogacy",
  "lang": "en",
  "field": null,
  "definition": null,
  "instances": []
},
{
  "term": "phenology",
  "lang": "en",
  "field": null,
  "definition": "the study of cyclic and seasonal natural phenomena, especially in relation to climate and plant and animal life",
  "instances": []
},
{
  "term": "transhumanism",
  "lang": "en",
  "field": ["philosophical", "intellectual"],
  "definition": "a philosophical and intellectual movement that advocates the enhancement of the human condition by developing and making widely available new and future technologies that can greatly enhance longevity, cognition, and well-being",
  "instances": []
},
{
  "term": "gray goo",
  "lang": "en",
  "field": ["philosophical", "intellectual"],
  "definition": ""
},
{
  "term": "venture capital",
  "lang": "en",
  "field": null,
  "definition": null,
  "instances": []
},
{
  "term": "overfitting",
  "lang": "en",
  "field": "modeling",
  "definition": "the production of an analysis that corresponds too closely or exactly to a particular set of data, and may therefore fail to fit to additional data or predict future observations reliably",
  "instances": []
},

{
  "term": "token",
  "lang": "en",
  "field": "civilization",
  "definition": "something that you do, or a thing that you give someone, that expresses your feelings or intentions, although it might have little practical effect",
  "instances": ["As a token of our gratitude for all that you have done, we would like you to accept this small gift."]
},


{
  "title": "El Reino de Dios es como un grano de mostaza",
  "lang": "en",
  "field": "nutrition",
  "type": "fact",
  "content": "many grain legumes are deficient in the sulfur-containing amino acids cystine and methionine"
},

{
  "title": "El Reino de Dios es como un grano de mostaza",
  "lang": "es",
  "field": "wisdom",
  "subfield": null,
  "discussion": [
    "Muchas cosas grandes empiezan siendo pequeñas",
    "A menudo nos cuesta apreciar la grandeza y consecuencias de algo simple"
  ],
  "related-to": [
    "kill a revolution in the bud",
    "El Principito obsesionado con arrancar baobabs incipientes"
  ]
},

{
  "topic": "expresión corporal",
  "lang": "es",
  "field": "human",
  "subfield": null,
  "discussion": ""
},

{
  "topic": "etymology",
  "lang": "en",
  "field": "linguistics",
  "subfield": "lexicology",
  "definition": "",
  "discussion": ""
},

{
  "topic": "ataques con drones a Rusia en E. de Siberia",
  "lang": "es",
  "field": "war",
  "date": "",
  "subfield": "recent developments",
  "discussion": ""
},

{
  "term": "alpha radiation",
  "lang": "en",
  "field": "nuclear physics",
  "symbol": "α",
  "definition": [
    "consist of two protons and two neutrons bound together into a particle identical to a helium-4 nucleus"
  ],
  "energy": "about 5 MeV"
},
{
  "term": "beta radiation",
  "lang": "en",
  "field": "nuclear physics",
  "symbol": "β",
  "definition": [
    "a high-energy, high-speed electron or positron emitted by the radioactive decay of an atomic nucleus, known as beta decay"
  ],
  "notes": [
    "There are two forms of beta decay, β− decay and β+ decay, which produce electrons and positrons, respectively"
  ]
},
{
  "term": "gamma radiation",
  "lang": "en",
  "field": "nuclear physics",
  "symbol": "γ",
  "definition": [
    "consists of the shortest wavelength electromagnetic waves, typically shorter than those of X-rays"
  ],
  "origin": [
    "high energy interactions like the radioactive decay of atomic nuclei",
    "astronomical events like solar flares"
  ],
  "energy": "from a few kiloelectronvolts (keV) to approximately 8 megaelectronvolts (MeV), corresponding to the typical energy levels in nuclei with reasonably long lifetimes",
  "notes": [
    "The energy ranges of gamma rays and X-rays overlap in the electromagnetic spectrum, so the terminology for these electromagnetic waves varies between scientific disciplines",
    "Gamma rays are ionizing radiation and are thus hazardous to life. They can cause DNA mutations, cancer and tumors, and at high doses burns and radiation sickness. Due to their high penetration power, they can damage bone marrow and internal organs. Unlike alpha and beta rays, they easily pass through the body and thus pose a formidable radiation protection challenge, requiring shielding made from dense materials such as lead or concrete. On Earth, the magnetosphere protects life from most types of lethal cosmic radiation other than gamma rays."
  ]
},

{
  "term": "casuística",
  "lang": "es",
  "field": "law",
  "definition": [
    "En la ética aplicada, la casuística se refiere al razonamiento basado en casos. Se utiliza en cuestiones éticas y jurídicas, y a menudo representa una crítica del razonamiento basado en principios o reglas. La casuística es utilizar la razón para resolver problemas morales aplicando reglas teóricas a instancias específicas."]
},
{
  "term": "ablation",
  "lang": "en",
  "field": "health",
  "subfield": "surgery",
  "definition": []
},

{
  "term": "nuclear proliferation",
  "lang": "en",
  "field": "nuclear weapons",
  "definition": []
},
{
  "term": "ablation",
  "lang": "en",
  "field": "nuclear weapons",
  "subfield": "thermonuclear weapons",
  "definition": []
},
{
  "title": "North Korean Nuclear Test",
  "lang": "en",
  "year": 2017,
  "field": "nuclear weapons",
  "subfield": "thermonuclear weapons",
  "subsubfield": "thermonuclear weapons test",
  "yield": {"unit": "kT", "amount": 300},
  "definition": []
},
{
  "term": "doomsday device",
  "lang": "en",
  "field": "nuclear weapons",
  "subfield": "thermonuclear weapons",
  "definition": []
},


{
  "term": "commodity",
  "lang": "en",
  "field": "economics",
  "subfield": null,
  "definition": []
},
{
  "term": "commoditization",
  "lang": "en",
  "field": "economics",
  "subfield": null,
  "definition": [],
  "related-to": ["money", "growth", "free-of-charge"]
},
{ "name": "Core Principles in a Field",
  "type": "quote",
  "author": "John Reed",
  "content": "When you first study a field, it seems like you have to memorize a zillion things. You don’t. What you need is to identify the three-to-five core principles that govern the field. The million things you thought you had to memorize are various combinations of the core principles."
},
{
  "term": "parameter",
  "lang": "en",
  "field": "functions",
  "subfield": null,
  "definition": [
  "a numerical or other measurable factor forming one of a set that defines a system or sets the conditions of its operation",
  "an element of a system that is useful, or critical, when identifying the system, or when evaluating its performance, status, condition, etc.",
  "a characteristic that defines or classifies a system, often used to set limits or conditions; it can be a variable in a mathematical equation or a fixed value that influences how something is done or performed."
  ],
  "notes": [
    "In statistics, parameters are characteristics of an entire population, such as the average age of teachers in the United States"
  ],
  "discussion": null
},
{
  "term": "emergent property",
  "lang": "en",
  "field": "systems",
  "subfield": null,
  "definition": "",
  "discussion": null
},

{
  "term": "cantala",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "henequen",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "sisal",
  "lang": "en",
  "field": "fibre",
  "definition": "",
  "discussion": null
},
{
  "term": "pulque",
  "lang": "es",
  "field": "beverage",
  "definition": "a milky fermented liquid, largely made from Agave salmiana, Agave mapisaga, and Agave americana sap, which has an herbal aroma, low alcohol content (4–6%), and high acidity (pH = 3.5–4.2)",
  "notes": [
    "its origins date back to the Early Classic period (AD 150–650), was used in religious rituals to honor the Aztec goddess, Mayahuel, and was regularly consumed by Aztec nobility"
  ],
  "discussion": null
},


{
  "term": "curated (pages)",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},

{
  "term": "Bayesian",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "Markov Chain",
  "lang": "en",
  "field": "probability",
  "definition": "",
  "discussion": null
},
{
  "term": "pastiche",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "espiritismo",
  "lang": "es",
  "field": "espíritu",
  "definition": "",
  "discussion": null
},


{
  "term": "deterrence",
  "lang": "en",
  "field": "nuclear war",
  "definition": "",
  "discussion": null
},
{
  "term": "ablation",
  "lang": "en",
  "field": "nuclear weapons",
  "definition": "",
  "discussion": null
},
{
  "term": "deconstruction",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "hermeneutics",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "etymon",
  "lang": "en",
  "field": "linguistics",
  "subfield": "historical linguistics",
  "definition": "the ultimate source word from which one or more cognates derive",
  "instances": [
    "the etymon of both Welsh ceffyl and Irish capall is the Proto-Celtic *kaballos (all meaning horse)"
  ]
},
{
  "term": "descendant",
  "lang": "en",
  "field": "linguistics",
  "subfield": "historical linguistics",
  "definition": "a word inherited across a language barrier, coming from a particular etymon in an ancestor language",
  "instances": [
    "Russian мо́ре and Polish morze are both descendants of Proto-Slavic *moře (meaning sea)"
  ]
},
{
  "term": "cognate",
  "lang": "en",
  "field": "linguistics",
  "subfield": "historical linguistics",
  "definition": "any of a set of words that have been inherited in direct descent from an etymological ancestor in a common parent language",
  "notes": [
    "because language change can have radical effects on both the sound and the meaning of a word, cognates may not be obvious, and it often takes rigorous study of historical sources and the application of the comparative method to establish whether lexemes are cognate",
    "cognates need not have the same meaning, as they may have undergone semantic change as the languages developed independently"
  ]
},
{
  "term": "root",
  "lang": "en",
  "field": "linguistics",
  "subfield": "lexicology",
  "definition": "the source of related words within a single language",
  "notes": [
    "no language barrier is crossed"
  ],
  "reciprocal": ""
},

{
  "term": "root",
  "lang": "en",
  "field": "linguistics",
  "subfield": "lexicology",
  "definition": "the source of related words within a single language",
  "notes": [
    "no language barrier is crossed"
  ],
  "reciprocal": "derivative"
},
{
  "term": "derivative",
  "lang": "en",
  "field": "linguistics",
  "subfield": "lexicology",
  "definition": "one of the words which have their source in a root word, and were at some time created from the root word using morphological constructs such as suffixes, prefixes, and slight changes to the vowels or to the consonants of the root word.",
  "notes": [
    "no language barrier is crossed"
  ],
  "reciprocal": "root"
},

{
  "term": "asyndeton",
  "lang": "en",
  "field": "linguistics",
  "definition": "",
  "discussion": null
},
{
  "term": "deismo",
  "lang": "es",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "teismo",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "burocracia",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},


{
  "term": "Agenda 2030",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},

{
  "term": "agency",
  "lang": "en",
  "field": null,
  "definition": "the sense of control that you feel in your life, your capacity to influence your own thoughts and behavior, and have faith in your ability to handle a wide range of tasks and situations. Your sense of agency helps you to be psychologically stable, yet flexible in the face of conflict or change",
  "discussion": null
},
{
  "term": "democracy",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "representation",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},
{
  "term": "paranomasia",
  "lang": "en",
  "field": "***",
  "definition": "",
  "discussion": null
},

{
  "term": "ataraxia",
  "lang": "en",
  "definition": "",
  "discussion": null
},
{
  "term": "anacrusis",
  "lang": "en",
  "field": "rhetoric",
  "definition": "",
  "discussion": null
},
{
  "term": "entelechia",
  "lang": "en",
  "field": "metaphysics",
  "definition": "",
  "discussion": null
},



{
  "term": "eudaimonia",
  "lang": "en",
  "definition": "",
  "discussion": null
},

{
  "term": "deity",
  "lang": "en",
  "definition": "",
  "discussion": null
},

{
  "term": "Agenda 2030",
  "definition": [
  ],
  "discussion": null
},

{
  "term": "endergonic",
  "definition": "a reaction that requires energy to be driven",
  "notes": [
    "Endergonic means \"absorbing energy in the form of work\".",
    "The activation energy for the reaction is typically larger than the overall energy of the exergonic reaction (1). Endergonic reactions are nonspontaneous."
  ]
},


{
  "type": "quote",
  "author": "Neal Stephenson",
  "content": "Where serious and competent people need to get things done in the real world, all considerations of tradition and protocol fly out of the window."
},
{
  "type": "quote",
  "author": "Neal Stephenson",
  "content": "The only thing that can effect a change in personality is something that physically rewires the brain and/or alters the body's chemical milieu."
},
{
  "type": "quote",
  "author": "Neal Stephenson",
  "content": "The future is there, looking back at us, trying to make sense of the fiction we will have become."
},
{
  "type": "quote",
  "author": "Neal Stephenson",
  "content": "Any property that is open to common use gets destroyed. Because everyone has incentive to use it to the max, but no one has incentive to maintain."
},
{
  "type": "quote",
  "author": "Neal Stephenson",
  "content": "Well, all information looks like noise until you break the code."
},

{
  "name": "How to Recycle Wipes"
},
{
  "name": "OneDrive on Linux",
  "field": "computing",
  "approach": "free lunch"
},

{
  "name":  "menial",
  "pronuciation": "//",
  "type":  "term",
  "word-class": "adj",
  "field": null,
  "culture": null,
  "lang":  "en",
  "definition": null,
  "instances": [],
  "discussion": [],
  "notes": [],
  "related-to": []
},
{
  "name":  "mind-numbing",
  "pronuciation": "//",
  "type":  "term",
  "word-class": "adj",
  "field": null,
  "culture": null,
  "lang":  "en",
  "definition": null,
  "instances": [],
  "discussion": [],
  "notes": [],
  "related-to": []
},
{
  "name":  "drudgery",
  "pronuciation": "//",
  "type":  "term",
  "word-class": "noun",
  "field": null,
  "culture": null,
  "lang":  "en",
  "definition": null,
  "instances": [],
  "discussion": [],
  "notes": [],
  "related-to": []
},
{
  "name":  "toil",
  "pronuciation": "//",
  "type":  "term",
  "word-class": "verb",
  "field": null,
  "culture": null,
  "lang":  "en",
  "definition": null,
  "instances": [],
  "discussion": [],
  "notes": [],
  "related-to": []
},


{
  "name": "catarsis",
  "lang": "es",
  "type": null,
  "field": "psicología",
  "definition": "f. Purificación, liberación o transformación interior suscitadas por una experiencia vital profunda.",
  "description": null
},
{
  "name": "unívoco",
  "lang": "es",
  "type": null,
  "field": "general",
  "definition": null,
  "examples": []
},
{
  "name": "ecologismo",
  "lang": "es",
  "type": null,
  "field": "movimiento social",
  "definition": null,
  "description": null
},
{
  "name": "ecología profunda",
  "lang": "es",
  "type": null,
  "field": "ecologismo",
  "source": "Wikipedia",
  "definition": "La ecología profunda es una rama de la filosofía ecológica que considera a la humanidad parte de su entorno, proponiendo cambios culturales, políticos, sociales y económicos para lograr una convivencia armónica entre los seres humanos y el resto de los seres vivos.",
  "description": null
},
{
  "name": "ecología profunda",
  "lang": "es",
  "type": "quote",
  "field": "ecologismo",
  "source": "Ecologistas en Acción",
  "author": "Arne Naess",
  "content": "la ecología profunda o de amplio alcance (deep, long-range ecology) se distingue de la ecología superficial o de corto alcance (shallow, short-range ecology) en un cuestionamiento más hondo de las causas y fundamentos de la crisis ecológica. Partiendo del reconocimiento del valor inherente de la diversidad ecológica y cultural de todos los seres vivos, su enfoque no se limita a aquello que pone en peligro el bienestar o la supervivencia de la especie humana. La ecología profunda declara la interdependencia fundamental entre todos los fenómenos y el hecho de que, como individuos y como sociedades, estamos inmersos en (y finalmente dependientes de) los procesos cíclicos de la naturaleza.",
  "related": ["sostenibilidad", "ecologismo", "interdependencia"]
},
{
  "name": "ecología profunda",
  "lang": "es",
  "type": null,
  "field": "ecologismo",
  "source": "Ecologistas en Acción",
  "definition": "",
  "description": null
},
{
   "name": "Arne Naess",
   "lang": "en",
   "field": "deep ecology",
   "nationality": "Norwegian"
},
{
  "title":   "Ecología profunda controvertida",
  "lang":    "es",
  "content": "Las posiciones defendidas por la ecología profunda han sido objeto de tantas controversias y críticas que merece la pena indagar en las razones que indujeron, por ejemplo, al cineasta y ecologista de moda, Al Gore, a calificarla como una filosofía “intrínsecamente misántropa” en la que el ser humano es “un alien en la Tierra” [1], o al intelectual francés Luc Ferry a concluir que “se puede decir legítimamente que la ecología profunda hunde algunas de sus raíces en el nazismo y alza sus ramas hasta las esferas más extremas del izquierdismo cultural” [2]. Y observamos que, en casi todos los casos, el pretendido radicalismo de la ecología profunda estriba en su crítica del antropocentrismo y de aquellos fundamentos culturales de Occidente que han abocado al mundo a la crisis multidimensional que enfrenta desde hace tiempo.",
  "source":  "Ecologistas en Acción"
},
{
  "name": "ecología profunda",
  "lang": "es",
  "type": null,
  "field": "ecologismo",
  "source": null,
  "definition": null,
  "description": null
},
{
  "name": "ecología profunda",
  "lang": "es",
  "type": null,
  "field": "ecologismo",
  "source": null,
  "definition": null,
  "description": null
},


{
  "name":    "butoh significa bailar con sombras",
  "type":    "quote",
  "topic":   "butoh",
  "field":   "art",
  "lang":    "es",
  "source":  "Cerezos en flor",
  "summary": null,
  "content": "Todo el mundo tiene sombra. Todo el mundo puede bailar butoh. Coger sombras. Cuantas más sombras."
}
]
