[
{
  "name": "rhubarb",
  "species": "Rheum rhabarbarum",
  "genus": "rheum",
  "family": "polygonaceae",
  "features": [
    "herbaceous",
    "perennial",
    ["leaves", ["large", "somewhat triangular shaped", "slightly toxic"] ],
    ["petioles", ["long", "fleshy petioles"] ],
    ["flowers",
     ["small", "greenish-white to rose-red", "grouped in large compound leafy inflorescences"]
    ]
  ],
  "native-to": ["eastern Europe", "southern Asia", "eastern temperate Asia", "northern tropical Asia"],
  "uses": ["medicinal", "food"],
  "contains_compounds": ["oxalic acid", "malic acid", "citric acid", "anthraquinone glycosides"],
  "cultivation": {
    "propagation": ["by cutting up the crowns of larger plants", "by seeds"],
    "sun": ["full", "tolerates partial shade"],
    "soil": ["well-draining", "fertile", "organic"],
    "plant": {
      "time": ["late autumn", "early spring"],
      "procedure": "plant 1-year-old rhubarb crowns",
      "spacing": "about 2 to 4 feet apart and 3 to 4 feet between rows",
      "depth": "plant crowns so the eyes are about 2 inches below the soil surface with buds facing up",
      "water": "thoroughly",
      "notes": [
        "plant rhubarb crowns after dormancy have set in in the fall to get rhubarb cropping in the spring",
        "in spring, plant crowns when the soil is workable, when the roots are still dormant, and before growth begins (or as plants are just beginning to leaf out); if you have a temperature gauge, soil temperature should be 50°F minimum",
        ["overcrowding", ["a common problem with rhubarb", "can lead to subpar growth", "dig and split rhubarb roots every 3 to 4 years; divide when plants are dormant in early spring (or late fall); divisions should have at least one large bud on them"]]
      ],
      "tips": [
        "mulch generously with a heavy layer of straw to retain moisture and discourage weeds",
        "water well and consistently; rhubarb needs sufficient moisture, especially during the hot, dry summer days",
        "remove seed stalks as soon as they appear, as they will only drain energy from the plant that could be used to produce stalks or roots",
        "each spring, apply a light sprinkling of a fertilizer (10-10-10) when the ground is thawing or has just thawed",
        "in the autumn, remove all plant debris. Once your ground freezes, it’s best to cover rhubarb with 2 to 4 inches of organic mulch, preferably well-rotted compost; by adding nitrogen to the soil, you’re preparing the rhubarb plants for a good spring season"
      ]
    }
  },
  "harvesting": {
    "when": [
      "do NOT harvest any stalks during the first growing season",
      "harvest sparingly in the second year: this allows your plants to become properly established",
      "after a plant’s third year, the harvest period (rhubarb season!) runs 8 to 10 weeks long, lasting through mid-summer",
      "harvest stalks when they are 12 to 18 inches long and at least 3/4-inch in diameter; if the stalks become thin, stop harvesting; the plant’s food reserves are low"
    ],
    "procedure": [
      "grab the base of the stalk and pull it away from the plant with a gentle twist; if this doesn’t work, you can cut the stalk at the base with a sharp knife; to prevent the spread of disease, be sure to sanitize the knife before cutting",
      "discard the leaves"
    ],
    "points": [
      "always leave at least two stalks per plant to ensure continued production; you may have a bountiful harvest for well over 10 years without replacing your rhubarb plants"
    ],
    "notes": [
      "It was once believed that the entire rhubarb plant became toxic as summer temperatures rose. This isn’t true, although summer-harvested stalks usually have a tougher texture than those picked in the spring. Nevertheless, after midsummer (July), it’s best to leave stalks on the plant to allow them to gather energy for next year’s growth."
    ]
  },
  "pests": [
    "botrytis (gray mold)",
    "fungal leaf spot",
    "phytophthora crown and root rot",
    "rhubarb curculio",
    "slugs/snails"
  ],
  "storing": {
    "refrigerator": [
      "cut the rhubarb stalks and refrigerate in a covered container",
      "or, tightly wrap stalks in plastic or aluminum foil and refrigerate",
      "rhubarb can be kept fresh in the refrigerator for a couple of weeks"
    ],
    "freezer": ["cut rhubarb stalks into pieces, place them in a covered container or zip-type plastic bag"]
  },
  "notes": [
    "all parts of the plant contain slightly poisonous oxalic acid, but its concentration in the leaf stems or petioles used in food preparation is very low, and their acidic flavour instead is caused by nontoxic malic acid. The plants also produce other compounds, including citric acid and anthraquinone glycosides, and the raw or cooked leaf blades are poisonous to humans and livestock if consumed in large enough amounts",
    "the roots of R. macrocarpum are exploited in the Tian-Shan to make a dye",
    "needs a dormancy period to thrive and produce an abundance of huge stalks",
    "does best where the average temperature falls below 40ºF (4°C) in the winter and below 75ºF (24°C) in the summer",
    "a healthy plant will remain productive for 10 years or more"
  ]
},

{
  "name": "spinach",
  "Spanish": "espinaca",
  "genus": "Spinacia",
  "species": "oleracea",
  "lifespan": "annual"
},
{
  "name": "lettuce",
  "Spanish": "lechuga",
  "species": "",
  "genus": "",
  "lifespan": "annual",
  "season": [
    "spring",
    "summer",
    "autumn",
    "winter"
  ]
},

{
  "name": "cellery",
  "Spanish": "apio",
  "genus": "Apium",
  "species": "graveolens"
  "botanical": "Apium graveolens",
  "family": "Apiaceae",
  "eaten": [
    "stalks",
    "leaves",
    "hypocotyl"
  ],
  "flowers": {
    "colour": "creamy white",
    "diameter": [
      2,
      3,
      "mm"
    ],
    "form": [
      "umbels",
      "dense",
      "compound"
    ]
  },
  "cultivars": [
    "graveolens",
    "rapaceum",
    "secalinum"
  ],
  "cultivation": "The plants are raised from seed, sown either in a hot bed or in the open garden according to the season of the year, and, after one or two thinnings and transplantings, they are, on attaining a height of 15–20 cm (6–8 in), planted out in deep trenches for convenience of blanching, which is effected by earthing up to exclude light from the stems. Development of self-blanching varieties of celery, which do not need to be earthed up, dominate both the commercial and amateur market.",
  "preservation": "Celery stalk may be preserved through pickling by first removing the leaves, then boiling the stalks in water before finally adding vinegar, salt, and vegetable oil"
}


]
