[

{
  "name": "BiCMOS",
  "lang": "en",
  "description": null
},

{
  "name": "Arduino UNO Q",
  "lang": "en",
  "field": "electronics",
  "type": "circuit board",
  "description": null,
  "contains": [
    "a quad-core Qualcomm processor running Debian Linux (you can run AI models or stream from a camera)",
    "a real-time STM32 microcontroller (handles the kind of low-latency control Arduino is known for)",
    "2 GB of RAM",
    "16 GB of eMMC storage",
    "Wi-Fi",
    "Bluetooth",
    "a full-size USB-C port that supports video out"
  ],
  "price": [44, null],
  "notes": [
    "will preserve Arduino's open tools and ecosystem",
    "keeps the standard UNO shield layout, so existing hardware should still fit",
    "Arduino has published the schematics and layout files under an open license",
    "the STM32 half of the board remains programmable through the traditional Arduino IDE"
  ]
},

{
  "name": "ngspice/PULSE",
  "lang": "en",
  "field": "electronics",
  "subfield": "analog",
  "subsubfield": "simulation",
  "type": "command",
  "prototype": "PULSE(voltage-low voltage-high initial-delat time-to-rise time-to-fall width period phase)",
  "instances": [
    "V1 in 0 dc 0 PULSE (0 5 1u 1u 1u 0.5 1)"
  ],
  "notes": [
    "width stands for the time at the top, the width of the pulse",
    "you may leave \"phase\" out"
  ],
  "description": "simulate a pulse"
},
{
  "name": "ngspice/tran",
  "lang": "en",
  "field": "electronics",
  "subfield": "analog",
  "subsubfield": "simulation",
  "type": "command",
  "prototype": "tran step span",
  "instances": [
    {"code": "tran 50u 50m", "discussion": "50u second steps over a span of 50m seconds"}
  ],
  "notes": [],
  "description": null
},
{
  "name": "ngspice/ac",
  "lang": "en",
  "field": "electronics",
  "subfield": "analog",
  "subsubfield": "simulation",
  "type": "command",
  "subtype": "control command",
  "prototype": null,
  "instances": [
    {"code": "ac dec 10 1 100k",
     "discussion": "vary the frequency as if plotted logarithmically, with 10 points per decade; the starting frequency is 1 Hz, the stopping frequency is 100 kHz"
    }
  ],
  "notes": [],
  "description": null
},
{
  "name": "ngspice/plot",
  "lang": "en",
  "field": "electronics",
  "subfield": "analog",
  "subsubfield": "simulation",
  "type": "command",
  "subtype": "control command",
  "prototype": "plot var1 ...",
  "instances": [
    {"code": "plot in0 out0"},
    {"code": "plot vdb(out) ph(out)", "discussion": "for 'out', plot the gain in dB and the phase"}
  ],
  "notes": [],
  "description": null
},

{
  "term": "band diagram",
  "lang": "en",
  "definition": "a diagram plotting various key electron energy levels (Fermi level and nearby energy band edges) as a function of some spatial dimension, which is often denoted x",
  "purpose": "help to explain the operation of many kinds of semiconductor devices and to visualize how bands change with position (band bending)"
},
{
  "term": "band gap",
  "lang": "en",
  "definition": "an energy range in a solid where no electronic states exist",
  "discussion": [
    "in graphs of the electronic band structure of solids, the band gap refers to the energy difference (often expressed in electronvolts) between the top of the valence band and the bottom of the conduction band in insulators and semiconductors",
    "it is the energy required to promote an electron from the valence band to the conduction band"
  ]
},
{
  "term": "Fermi level",
  "lang": "en",
  "definition": "of a solid-state body, it is the thermodynamic work required to add one electron to the body",
  "notes": [
    "a thermodynamic quantity usually denoted by μ or E_F for brevity",
    "does not include the work required to remove the electron from wherever it came from",
    "a precise understanding of the Fermi level—how it relates to electronic band structure in determining electronic properties; how it relates to the voltage and flow of charge in an electronic circuit—is essential to an understanding of solid-state physics"
  ]
},
{
  "term": "Fermi energy",
  "lang": "en",
  "definition": "",
  "notes": []
},





{
  "term": "diode",
  "field": "electronics",
  "type": "device",
  "definition": null,
  "parameters": [
    {"term": "breakdown voltage", "definition": "reverse voltage where the valve effect fails and the diode starts conducting"},
    {"term": "forward voltage drop", "definition": "voltage drop when forward biased", "value": 0.65}
  ],
  "notes": [
    "the cathode is marked with a ring or a shorter pin (LEDs)"
  ]
},
{
  "term": "Zener diode",
  "field": "electronics",
  "is-a": "diode",
  "definition": "a diode so built that it has a very predictable operation at its breakdown voltage; in fact, at its breakdown voltage, it acts like a normal diode with a larger voltage drop",
  "keywords": ["breakdown voltage"],
  "notes": [
    "with a Zener diode, since you are using its breakdown voltage rather than its forward voltage, it is wired into your circuit backward",
    "the breakdown voltage drop for a Zener diode is much more constant over a larger range of current than the forward voltage drop of most regular diodes"
  ]
},
{
  "term": "Schottky diode",
  "field": "electronics",
  "is-a": "diode",
  "description": "very similar to a normal diode, but made using a different process, so that its voltage drop is significantly reduced: while a normal diode’s forward voltage drop is about 0.6 V, a Schottky diode’s voltage drop can be as low as 0.15 V",
  "uses": [
    "useful for regulating the direction of electrical flow when the voltage requirements are sensitive enough that you can’t afford the 0.6 V of a regular diode"
  ]
},
{
  "term": "Light Emitting Diode",
  "shortword": "LED",
  "field": "electronics",
  "is-a": "diode",
  "definition": "a diode that emits light when conducting in forward bias",
  "notes": [
    "voltage drop highly dependent on type/colour, typically 1.8 to 3.3 volts"
  ]
},
{
  "term": "pull-up resistor",
  "field": "electronics",
  "is-a": "configuration",
  "description": "a resistor is connected to the positive voltage source and is used to \"pull up\" the voltage on the circuit to a positive value when the switch is open while still providing safety (by limiting the current) when the switch is closed",
  "notes": [
    "many (but certainly not all) ICs do not source current, using open collectors for their output operations. This has the disadvantage that you have to supply your own voltage and pull-up resistor to the output pin, but it also has the advantage that the output is set to whatever voltage level you choose"
  ]
},
{
  "term": "integrated circuit",
  "lang": "en",
  "synonyms": ["IC", "chip", "microchip"],
  "field": "electronics",
  "is-a": "device",
  "description": "a miniaturized circuit placed on a silicon plate, called the die, where all of the action takes place. The die is then placed into a package, which then provides connection points for circuit designers to interface with the IC, often called pins or pads. Each pin on an IC is numbered, starting with pin 1",
  "kinds": [
    {"term": "through-hole",
     "description": "the connection points are long pins which can be used on a breadboard",
     "uses": ["amateur"],
     "notes": [
       "a common through-hole package is the dual in-line package, or DIP"
     ]},
    {"term": "surface mount",
     "description": "the connection points are small pads which are meant to be soldered to a circuit board. These packages are much smaller (and therefore less expensive) and can be more easily managed by automated systems to build completed circuits. Also referred to as SMDs (surface mount devices) or SMT (surface mount technology)",
     "uses": ["industrial", "automated"]}
  ],
  "notes": [
    "knowing which pin is which is important, because most of the pins on a chip each have their own purpose, so if you attach a wire to the wrong pin, your circuit won’t work or you will destroy the chip.",
    "most packages are marked with the chip’s manufacturer and part number",
    "The voltage pins on integrated circuits can be marked in a number of different ways. The positive voltage source is often labeled as VCC , VDD, or V+. The ground connect is often labeled as GND, VEE, VSS, or V−. There are additional ways that these are labeled as well"
  ]
},
{
  "name": "LM393",
  "field": "electronics",
  "is-a": "integrated circuit",
  "action": "compares two input voltages and then outputs either a high-­voltage signal or a low-voltage signal depending on which input voltage is greater",
  "definition": null,
  "notes": [
    "actually a dual voltage comparator, which means that it will do two separate comparisons on the same chip",
    "an active device"
  ]
},
{
  "term": "open-collector",
  "field": "electronics",
  "is-a": "configuration",
  "description": "high-voltage outputs don’t conduct",
  "advantages": [
    "this lets us set our own output voltage to whatever we want without causing too much complexity"
  ]
},
{
  "term": "source",
  "field": "electronics",
  "definition": "a component whose pins might provide current to other parts of the circuit"
},
{
  "term": "sink",
  "field": "electronics",
  "definition": "a component whose pins might pull current from other parts of the circuit"
},
{
  "term": "digital logic",
  "field": "electronics",
  "subfield": "digital electronics",
  "description": "electric voltages are given meanings of either \"true\" or \"false,\" usually with \"false\" being a voltage near zero and \"true\" being a positive voltage (often between 3 and 5 volts). These values are also referred to by a number of other designations—a 1 (for true) and 0 (for false) or HIGH (for true) and LOW (for false)"
},
{
  "term": "digital logic integrated circuit (IC)",
  "field": "electronics",
  "is-a": "device",
  "definition": "an IC that implements a/some basic functions of digital logic"
},
{
  "term": "inverted inputs and outputs",
  "field": "electronics",
  "subfield": "digital electronics",
  "description": [
    "Sometimes an input or an output on a chip will be labeled with a line on top of the input or output name. This means that the result (or requirement) will be the opposite of what you would otherwise expect. For instance, if the output is Y, then Y refers to the opposite value of Y. So, if Y is true, then Y will be false.",
    "The same can occur on inputs as well. For instance, some chips have a reset on the chip which will reset the chip. However, we would normally consider “signaling” a pin to be sending it a voltage. Sometimes the chips would prefer that you signal the reset by bringing the voltage low instead of high. In these cases, they usually designate this by putting a bar over the name of the input pin, so the reset pin would be labeled RESET in order to indicate this behavior."
  ]
},
{
  "term": "development board",
  "field": "electronics",
  "is-a": "circuit",
  "definition": "a prebuilt circuit that has a microcontroller chip pre-connected in its recommended manner. It is made to simplify the work of developing circuits"
},
{
  "term": "in-system programmer",
  "shortword": "ISP",
  "field": "electronics",
  "subfield": "digital electronics",
  "is-a": "device",
  "definition": "connects your computer to your chip or development board and will transmit/upload the program from your computer to the chip"
},
{
  "term": "headers",
  "field": "electronics",
  "definition": "places, usually pins or holes, on an electronics (development) board where additional circuits or wires can be attached"
},
{
  "term": "baud",
  "field": "electronics",
  "subfield": "telecommunications",
  "definition": "bits per second"
},
{
  "term": "ceramic capacitor",
  "field": "electronics",
  "is-a": "capacitor",
  "definition": null
},
{
  "term": "electrolytic",
  "field": "electronics",
  "is-a": "capacitor",
  "definition": null
},

{
  "term": "oscillating circuit",
  "field": "electronics",
  "is-a": "circuit",
  "definition": "a circuit that goes back and forth continually between two states, usually zero voltage and some positive voltage",
  "discussion": [
    "usually described by either its period or its frequency"
  ]
},
{
  "term": "servo motor",
  "field": "electrical",
  "is-a": "electric motor",
  "definition": "a motor which moves an arm to a specific angle (i.e., think of a car’s steering wheel)",
  "notes": [
    "usually operated by frequencies, where each frequency specifies a different angle to move"
  ]
},
{
  "term": "NE555",
  "field": "electronics",
  "is-a": "integrated circuit",
  "action": ["oscillate", "delay"],
  "description": null,
  "pinout": [
    {"name": "reset", "action": null},
    {"name": "output", "action": null},
    {"name": "trigger", "action": null},
    {"name": "ground", "action": null},
    {"name": "Vcc", "action": null},
    {"name": "discharge", "action": null},
    {"name": "threshold", "action": null},
    {"name": "control", "action": null}
  ]
},
{
  "term": "pinout",
  "field": "electronics",
  "lang": "en",
  "is-a": "",
  "definition": null
},
{
  "term": "amplification",
  "field": "electronics",
  "definition": "the conversion of a low-power signal to a higher-power signal"
},
{
  "term": "gain (of an amplifier)",
  "field": "electronics",
  "is-a": "",
  "definition": "the amount of amplification that occurs"
},
{
  "term": "transistor",
  "field": "electronics",
  "is-a": "device",
  "definition": "a device that regulates the current between two (of its three) terminals through a small current (BJTs) or voltage (FETs) signal"
},
{
  "term": "2N2222A",
  "field": "electronics",
  "subfield": "analog electronics",
  "is-a": "transistor",
  "package": "TO-92",
  "characteristics": []
},
{
  "term": "snubber",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "a diode placed in parallel with an inductor so that when the circuit is opened the inductor may discharge back"
},
{
  "term": "feedback resistor",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "in a common emitter amplifier, add a resistor between the emitter (and ground) so that when beta increases the rise in current makes IBE smaller, and the other way round, thus compensating for the variation in beta"
},
{
  "term": "bleed-off resistor",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "a large resistor from one side of a capacitor to (earth) so that the capacitor may discharge or equilize its voltage to (zero) on that side of its"
},
{
  "term": "stomp box",
  "field": "electronics",
  "is-a": "device",
  "definition": "a device to modulate the incoming signal in some way"
},
{
  "term": "Thévenin equivalent circuit",
  "field": "electronics",
  "is-a": "model",
  "action": "represents the way that a partial circuit looks to other parts of the circuit",
  "description": "reduces a partial circuit to (1) a single voltage source (AC, DC, or DC-biased AC, expressed in RMS voltage), and (2) a single impedance (e.g., resistance) in series with the voltage source",
  "notes": [
    "the single voltage source may be different than the voltage source that is actually connected"
  ]
},
{
  "term": "anode",
  "field": "electronics",
  "is-a": "",
  "definition": "the positive side of a polarized device",
  "notes": ["in batteries, the anode is actually the negative terminal (because the positive charge enters here)"]
},
{
  "term": "AC mains",
  "field": "electronics",
  "definition": "the type of current that is supplied to your house by the public utility companies"
},
{
  "term": "brushed electric motor",
  "field": "electronics",
  "is-a": "electric motor",
  "definition": "a motor that operates by changing its interior magnetic configuration based on wires that are rotating in the shaft"
},
{
  "term": "brushless electric motor",
  "field": "electronics",
  "is-a": "electric motor",
  "definition": "a motor that operates by changing its exterior magnetic configuration based on generating an alternating current inside the motor",
  "notes": ["less prone to fail because of fewer parts that wear down"]
},
{
  "term": "capacitative reactance",
  "field": "electronics",
  "is-a": "magnitude",
  "definition": "the reactance that comes from capacitor-like components"
},
{
  "term": "carrier frequency",
  "field": "electronics",
  "definition": "a frequency on which another signal is laid"
},
{
  "term": "cathode",
  "field": "electronics",
  "definition": "a cathode is the “negative side” of a polarized device",
  "notes": ["in batteries, the cathode is actually the positive terminal (because the positive charge leaves here)"]
},
{
  "term": "circuit pattern",
  "field": "electronics",
  "definition": "a circuit pattern is a common way of building (and understanding) certain types of circuits or subcircuits"
},
{
  "term": "common emitter",
  "field": "electronics",
  "is-a": "circuit pattern",
  "definition": "a transistor circuit pattern where the emitter is tied to a known, fixed voltage"
},
{
  "term": "conventional current flow",
  "field": "electronics",
  "is-a": "convention",
  "definition": "to trace the flow of positive charge in a circuit from a positive source (often a battery) to either ground or a negative terminal"
},
{
  "term": "coupling capacitor",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "a capacitor that links to circuits, usually at different DC offsets",
  "action": "it transmits changes in voltage (i.e., AC) while blocking the DC offset voltages from influencing each other"
},
{
  "term": "DC offset",
  "field": "electronics",
  "definition": "a voltage, usually other than zero, that an alternating current is centered around"
},
{
  "term": "depletion mode (FET)",
  "field": "electronics",
  "is-a": "FET transistor",
  "definition": "means that the FET normally conducts between the drain and source, but will be inhibited by sufficient gate-to-source voltage (sufficiently positive for a P-channel or sufficiently negative for an N-channel)"
},
{
  "term": "direct current",
  "field": "electronics",
  "definition": "the flow of current maintains the same direction and value"
},
{
  "term": "heat dissipation",
  "field": "electronics",
  "definition": "the removal of extra heat generated in circuits"
},
{
  "term": "dual in-line",
  "field": "electronics",
  "is-a": "package",
  "definition": "a type of package for integrated circuits which has two parallel sets of pins which fits nicely across the bridge of a breadboard"
},
{
  "term": "enhancement mode FET",
  "field": "electronics",
  "is-a": "FET",
  "definition": "a FET that normally does not conduct between the drain and source, while sufficient gate-to-source voltage will allow conduction (sufficiently positive if it is an N-channel and sufficiently negative if it is a P-channel)"
},
{
  "term": "equivalent resistance",
  "field": "electronics",
  "is-a": "model",
  "definition": "a resistor that would replace (is equivalent to) multiple resistors are connected in series or in parallel"
},
{
  "term": "feedback",
  "field": "electronics",
  "definition": "when the output of a process feeds back into the input of a process"
},
{
  "term": "filtering capacitor",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "a capacitor used to remove signals of a certain range of frequencies from the signal"
},
{
  "term": "flash memory",
  "field": "electronics",
  "definition": "a type of memory in integrated circuits that is retained even after the power to the device is removed"
},
{
  "term": "flyback diode",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "snubber diode"
},
{
  "term": "ground",
  "field": "electronics",
  "definition": "the chosen point on a circuit by which to measure other voltages",
  "notes": ["on DC battery circuits, it is usually simply the negative terminal of the battery"]
},
{
  "term": "heatsink",
  "field": "electronics",
  "is-a": "component",
  "definition": "an object, usually large and metallic, which attaches to a part of a circuit to dissipate heat into the environment and away from the circuit itself"
},
{
  "term": "inductive kick",
  "field": "electronics",
  "is-a": "effect",
  "definition": "when current is suddenly blocked to an inductor, the magnetic field suddenly collapses and generates a sudden large voltage at the cathode"
},
{
  "term": "inductive reactance",
  "field": "electronics",
  "is-a": "magnitude",
  "definition": "the reactance that comes from inductor-like components"
},
{
  "term": "impedance. Impedance is usually based on a specific frequency",
  "field": "electronics",
  "is-a": "",
  "definition": "the amount of resistance a circuit offers to alternating current which combines resistance and reactance",
  "notes": ["usually based on a specific frequency"]
},
{
  "term": "inefficiency",
  "field": "technology",
  "definition": "the amount of energy that is wasted in performing a process",
  "notes": ["all processes are inefficient to some degree"]
},
{
  "term": "junction",
  "field": "electronics",
  "definition": "the point where two or more wires or components are connected together"
},
{
  "term": "Kirchhoff's current law",
  "field": "electronics",
  "subfield": "digital electronics",
  "is-a": "law",
  "definition": "at any junction, the total amount of current going into a junction is exactly the same as the total amount of current going out of that junction"
},
{
  "term": "Kirchhoff's voltage law",
  "field": "electronics",
  "subfield": "digital electronics",
  "is-a": "law",
  "definition": "given any two specific points on a circuit (at a particular point in time), no matter what path is traveled to get from one point to the other, the difference in voltage between the two points is the same",
  "notes": [ "this can also be stated equivalently as saying that any complete, closed path around a circuit has a total voltage drop of zero"]
},
{
  "term": "latch",
  "field": "electronics",
  "subfield": "digital electronics",
  "is-a": "device",
  "definition": "a simple type of memory that stores a single bit using logic gates"
},
{
  "term": "logic function",
  "field": "electronics",
  "subfield": "digital electronics",
  "definition": "a function that takes in one or more logic (true/false) values as input and produces one or more (usually one) logic values as output"
},
{
  "term": "logic gate",
  "field": "electronics",
  "subfield": "digital electronics",
  "definition": "a circuit which implements a logic function"
},
{
  "term": "microcontroller",
  "field": "electronics",
  "is-a": "device",
  "definition": "an integrated circuit which operates as a standalone computer"
},
{
  "term": "non-polarized component",
  "field": "electronics",
  "definition": "a circuit component (such as a resistor) where it does not matter which end is used as the anode or cathode"
},
{
  "term": "open circuit",
  "field": "electronics",
  "definition": "a condition where there is no electrical pathway for the current to flow"
},
{
  "term": "open collector",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "a type of output from a circuit where the \"positive\" state is actually disconnected, while the \"zero\" state is an actual ground voltage",
  "notes": ["this is often used to allow the user of the circuit to supply their own voltage through a pull-up resistor"]
},
{
  "term": "oscillator",
  "field": "electronics",
  "definition": "a circuit that switches back and forth between two or more states (e.g., positive voltage to zero voltage) in a regular fashion"
},
{
  "term": "pinout",
  "field": "electronics",
  "definition": "the meaning/purpose assigned to each pin of a particular integrated circuit"
},
{
  "term": "polarized component",
  "field": "electronics",
  "definition": "a circuit component (such as a diode) which has an explicit anode and cathode (i.e., the sides of the component are not interchangeable)"
},
{
  "term": "power transistor",
  "field": "electronics",
  "is-a": "device",
  "definition": "a transistor made to handle large amounts of voltage and current"
},
{
  "term": "pull-up resistor",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "a resistor connected to a positive voltage which gives a default positive voltage if no other voltage is connected on the line"
},
{
  "term": "pull-down resistor",
  "field": "electronics",
  "is-a": "configuration",
  "definition": "a resistor connected to a positive voltage which gives a default zero voltage if no other voltage is connected on the line"
},
{
  "term": "pulse-width modulation",
  "field": "electronics",
  "definition": "sending a signal using a fixed pulse frequency, but where the percentage of time the signal is high vs. low varies. This is a way of outputting voltage levels on devices that don’t support outputting at different voltage levels"
},
{
  "term": "quiescent current",
  "field": "electronics",
  "subfield": "analog electronics",
  "definition": "in a transistor amplifier, it is the amount of current that is flowing into the base of the transistor when no signal is applied"
},
{
  "term": "RC circuit",
  "field": "electronics",
  "subfield": "analog electronics",
  "is-a": "configuration",
  "definition": "a resistor in series with a capacitor, usually used for timing"
},
{
  "term": "reactance",
  "field": "electronics",
  "definition": "a part of impedance which is similar to resistance but operates by preventing flow rather than dissipating energy",
  "notes": ["usually dependent on the frequency of the signal"]
},
{
  "term": "resonant frequency",
  "field": "electronics",
  "definition": "given a circuit, the frequency where the inductive and capacitative reactances cancel each other out"
},
{
  "term": "RS-232",
  "field": "electronics",
  "subfield": "digital electronics",
  "is-a": "protocol",
  "definition": "a protocol for serial communication describing voltage levels, timing, and other important signaling features for sending and receiving bits using two wires"
},
{
  "term": "saturation mode",
  "field": "electronics",
  "subfield": "analog electronics",
  "definition": "it occurs in a transistor when it is fully on and cannot amplify the signal further",
  "notes": ["in saturation mode, the transistor acts more like a switch that is on rather than as an amplifier"]
},
{
  "term": "serial interface",
  "field": "electronics",
  "subfield": "digital electronics",
  "definition": "a type of input/output mechanism that sends data a single bit at a time, oftentimes using the RS-232 protocol"
},
{
  "term": "servo motor",
  "field": "electronics",
  "is-a": "motor",
  "definition": "a motor that, instead of spinning, creates an angle"
},
{
  "term": "sink",
  "field": "electronics",
  "definition": "when a component or circuit receives incoming current"
},
{
  "term": "solderless breadboard",
  "field": "electronics",
  "definition": "a device consisting of a number of connected terminals where components can be inserted and removed at will, which allows for the construction of circuits in a nonpermanent way"
},
{
  "term": "snubber diode",
  "field": "electronics",
  "subfield": "analog electronics",
  "is-a": "configuration",
  "definition": "a diode that is wired backward across the terminals of an inductor to protect the circuit against inductive kick"
},
{
  "term": "source",
  "field": "electronics",
  "definition": "when a component or circuit provides current output"
},
{
  "term": "stall condition",
  "field": "electronics",
  "definition": "in an electric motor, this is the condition where the motor is not turning while it is exhibiting its maximum torque"
},
{
  "term": "transformer",
  "field": "electronics",
  "definition": "a pair of inductors which utilize the magnetic field in one coil to generate a current in the other inductor",
  "notes": ["commonly used to convert voltage levels in different circuits and to isolate parts of a circuit. Transformers only operate on AC circuits"]
},
{
  "term": "voltage divider",
  "field": "electronics",
  "subfield": "analog electronics",
  "is-a": "configuration",
  "definition": "when there are two components (usually resistors) connected together with a terminal coming out from between them meant to have a voltage between that of the two components"
},
{
  "term": "Zener diode",
  "field": "electronics",
  "subfield": "analog electronics",
  "is-a": "configuration",
  "definition": "a diode which is meant to be wired in such a way as to take advantage of its breakdown voltage"
},
{
  "term": "",
  "field": "electronics",
  "definition": ""
}
]
