[
{
  "name": "pecan",
  "pronuciation": "/pɪˈkæn/",
  "lang": "en",
  "genus": "Carya",
  "species": "illinoinensis",
  "native-to": "Southern United States and northern Mexico in the region of the Mississippi River",
  "description": "a large deciduous tree, growing to 20–40 m (66–131 ft) in height, rarely to 44 m (144 ft). It typically has a spread of 12–23 m (39–75 ft) with a trunk up to 2 m (6 ft 7 in) diameter. A 10-year-old sapling grown in optimal conditions will stand about 5 m (16 ft) tall. The leaves are alternate, 30–45 cm (12–18 in) long, and pinnate with 9–17 leaflets, each leaflet 5–12 cm (2–4+1⁄2 in) long and 2–6 cm (1–2+1⁄2 in) broad.",
  "note": "a pecan, like the fruit of all other members of the hickory genus, is not truly a nut, but is technically a drupe. The husks are produced from the exocarp tissue of the flower, while the part known as the nut develops from the endocarp and contains the seed. The husk itself is aeneous, that is, brassy greenish-gold in color, oval to oblong in shape, 2.6–6 cm (1–2+3⁄8 in) long, and 1.5–3 cm (5⁄8–1+1⁄8 in) broad. The outer husk is 3–4 mm (1⁄8–5⁄32 in) thick, starts out green, and turns brown at maturity, at which time it splits off in four sections to release the thin-shelled seed.",
  "genetics": "Pecan is a 32-chromosome species (1N = 16) that readily hybridizes with other 32-chromosome members of the Carya genus, such as Carya ovata, Carya laciniosa, Carya cordiformis and has been reported to hybridize with 64-chromosome species such as Carya tomentosa. Most such hybrids are unproductive. Hybrids are referred to as \"hicans\" to indicate their hybrid origin.",
  "uses": ["The seed is an edible nut used as a snack and in various recipes, such as praline candy and pecan pie."],
  "nutrition": "A pecan nut is 4% water, 72% fat, 9% protein, and 14% carbohydrates. In a 100 g reference amount, pecans provide 690 calories and are a rich source (20% or more of the Daily Value, DV) of dietary fiber (38% DV), manganese (214% DV), magnesium (34% DV), phosphorus (40% DV), zinc (48% DV), and thiamine (57% DV). Pecans are a moderate source (10–19% DV) of iron and B vitamins. Pecan fat content consists principally of monounsaturated fatty acids, mainly oleic acid (57% of total fat), and the polyunsaturated fatty acid, linoleic acid (30% of total fat).",
  "nutrition-percentages": [
    ["water", 4],
    ["fat", 72],
    ["protein", 9],
    ["carbohydrates", 14]
  ],
  "cultivation": {
    "history": "Pecans are one of the most recently domesticated of the major crops.",
    "climate": "grow best where summers are long, hot and humid. The nut harvest for growers is typically around mid-October.",
    "water": "Pecan trees require large quantities of water during the growing season, and most orchards in the region use flood irrigation to optimize consumptive water use and production of mature pecans.",
    "pollination": "Generally, two or more trees of different cultivars must be present to pollinate each other.",
    "cultivars": []
  },
  "pests": [
    "pecan scab",
    "hickory shuckworm",
    "shuck decline",
    "ambrosia beetles",
    "twig girdlers",
    "pecan nut casebearer",
    "phylloxera",
    "curculio",
    "weevils",
    "aphids"]
},

{
  "name": "peanut",
  "pronuciation": "//",
  "lang": "en",
  "genus": "Arachis",
  "species": "hypogaea",
  "description": "",
  "uses": [],
  "cultivation": {
    "history": null,
    "climate": "WHATEVER",
    "cultivars": null
  }
},

{
  "name": "quinoa",
  "pronuciation": "//",
  "lang": "en",
  "genus": "Chenopodium",
  "species": "quinoa",
  "informal-type": "pseudocereal",
  "description": "",
  "uses": [],
  "cultivation": {
    "history": null,
    "climate": "WHATEVER",
    "cultivars": null
  }
},


{
  "name": "arbor",
  "type": "term",
  "field": "gardening",
  "lang": "en",
  "definition": "a structure, often made of wood, that creates a shaded walkway or doorway, often in a garden setting",
  "notes": [
    "agroforestry integrates trees into farming systems, offering benefits like improved soil health and water quality, while garden arbors, also known as arbours or pergolas, create shaded spaces and focal points in gardens",
    "can add aesthetic appeal to a garden and create a sense of enclosure or transition"
  ]
},

{
  "name":  "shuck decline",
  "type":  "term",
  "field": "farming",
  "lang":  "en",
  "definition": "a disorder where the outer shell (shuck) of the pecan nut turns black and sticks tightly to the shell, often due to stress from a heavy crop load",
  "notes": [
    "the first symptom of shuck decline is a thin, dark, necrotic line on the inner shuck, which then spreads to the outer surface of the shuck"
  ]
},
{
  "term":  "chilling",
  "field": "farming botany",
  "lang":  "en",
  "definition": "related to chill hours, a measure of the accumulated cold temperatures needed for certain crops to properly break dormancy and flower/fruit"
},

{
  "term": "biological pest control",
  "lang": "en",
  "field": "farming",
  "definition": "the use of living organisms to manage or reduce populations of harmful pests; it relies on natural enemies like predators, parasitoids, and pathogens to suppress pest populations, rather than relying solely on synthetic pesticides",
  "notes": ["aims to create a balanced ecosystem where beneficial organisms help keep pest numbers in check, reducing the need for chemical interventions"]
},

{
  "term":  "final frost date",
  "field": "farming",
  "lang":  "en",
  "definition": "the last day you can expect frost",
  "notes": [
    "many potted plants and tender rhizomes must be kept indoors until after all threat of frost has passed, and some bareroots need to be kept out of frosty conditions in their first year",
    "some cold-hardy plants, such as leafy vegetables grown from seed, can go into the ground before the last frost date",
    "knowing your final frost date can also help you plan for starting flowers indoors. For example, if you plan to put dahlias outdoors after the last frost, but want an early start on them, you can count backward from that last date"]
},
{
  "term":  "first frost date",
  "field": "farming",
  "lang":  "en",
  "definition": "the first day of fall that you must watch out for frost",
  "notes": [
  "some summer bulbs need to come out of the ground before the first frost: these include caladiums and others that don't naturally encounter frost at all",
  "if you plan to lift and bring hardier bulbs inside, you'll need to wait for that final frost, and for the foliage to die back. For most summer bulbs, that occurs six weeks after flowering",
  "if you're planting hardy bulbs, such as tulips or daffodils, do that after the first frost"
  ]
},

{
  "term":  "hardiness zone",
  "field": "farming",
  "lang":  "en",
  "definition": "a geographic area defined as having a certain average annual minimum temperature, being a factor relevant to the survival of many (perennial) plants",
  "notes": ["the original and most widely used system is the one developed by the United States Department of Agriculture (USDA)"]
},
{
  "term": "indicator plant",
  "lang": "en",
  "field": "farming",
  "definition": "one that, by its presence or absence, suggests specific soil conditions, nutrient levels, or environmental factors",
  "notes": [
    "they act as \"bioindicators,\" providing insights into the health and suitability of the land for different agricultural practices",
    "by observing these plants, farmers can make informed decisions about soil management, fertilization, and crop selection"
  ],
  "soil": {
    "sandy": ["savory", "lavender", "oregano", "rosemary"],
    "heavy": ["parsley", "mint"],
    "nitrogen-rich": ["chickweed", "nettle", "meadow hogweed", "meadow chervil"],
    "nitrogen-poor": ["lavender", "rosemary", "sage", "wild carrot", "dog chamomile"],
    "acidic": ["bilberry", "cranberry", "dog chamomile", "small dock"],
    "calcareous": ["chicory", "meadow sage", "lavender", "parsley"]
  }
},
{
  "name":  "USDA Cultivation Zones",
  "type":  "classification",
  "field": "farming",
  "lang":  "en",
  "definition": "a classification based on the average annual minimum winter temperature, with each zone representing a 10-degree Fahrenheit range",
  "notes": [
    "each zone is further divided into 'a' and 'b' subzones, representing 5-degree increments"
  ],
  "list": [
    null,
    {"F": [-60,-50], "C": [-55.1, -45.6], "N": 1},
    {"F": [-50,-40], "C": [-45.6, -40], "N": 2},
    {"F": [-40,-30], "C": [-40, -34.4], "N": 3},
    {"F": [-30,-20], "C": [-34.4,-28.9], "N": 4},
    {"F": [-20,-10], "C": [-28.9,-23.3], "N": 5},
    {"F": [-10,0], "C": [-23.3,-17.8], "N": 6},
    {"F": [0,10], "C": [-17.8, -12.2], "N": 7},
    {"F": [10,20], "C": [-12.2, -6.7], "N": 8},
    {"F": [20,30], "C": [-6.7, -1.1], "N": 9},
    {"F": [30,40], "C": [-1.1,4.4], "N": 10},
    {"F": [40,50], "C": [4.4, 10], "N": 11},
    {"F": [50,60], "C": [10, 15.6], "N": 12},
    {"F": [60,70], "C": [15.6, 21.1], "N": 13}
  ],
  "alternatives": [
    "indicator plants",
    "Köppen climate classification",
    "Trewartha climate classification system"
  ]
},

{
  "name": "compost green to brown ratio",
  "lang": "en",
  "field": "farming",
  "subfield": "composting",
  "description": "the ideal ratio for backyard composting is generally considered to be 3 to 4 parts brown materials to 1 part green materials, by volume",
  "warnings": [
    "in addition to the proper ratio, you must determine what can be composted: while all organic materials will decompose, not all organics are suitable for composting"
  ]
},
{
  "term": "green compost materials",
  "lang": "en",
  "field": "farming",
  "subfield": "composting",
  "definition": "materials that are rich in nitrogen or protein",
  "effects": [
    "they tend to heat a compost pile up because they help the microorganisms in the pile grow and multiply quickly"
  ],
  "instances": [
    "grass clippings",
    "fresh manure",
    "coffee grounds",
    "plant trimmings",
    "fruit peelings and scraps",
    "vegetable peelings and scraps",
    "egg shells",
    "seaweed"
  ]
},
{
  "term": "brown compost materials",
  "lang": "en",
  "field": "farming",
  "subfield": "composting",
  "definition": "carbon or carbohydrate-rich materials",
  "effects": [
    "feed all of the soil-dwelling organisms that will work with the microbes to break down the contents of your compost pile"
  ],
  "instances": [
    "black-and-white newspapers (color ink is toxic to plants)",
    "dead leaves",
    "straw",
    "woodstove ash"
  ]
},
{
  "term": "vermicomposting",
  "lang": "en",
  "field": "farming",
  "subfield": "composting",
  "definition": "a process that uses specific types of earthworms, such as red wigglers, to break down organic waste, including food scraps and yard trimmings, into a nutrient-rich soil amendment called vermicompost"
},
{
  "term": "soil amendment",
  "lang": "en",
  "field": "farming",
  "definition": "any material added to the soil to improve its physical or chemical properties",
  "improves": [
    "seed germination",
    "root development",
    "resistance to drought, stress",
    "leaf growth",
    "fruit set",
    "flavor of fruit/vegetable",
    "nutrient uptake",
    "water retention",
    "permeability",
    "aeration",
    "structure"
  ],
  "includes": [
    "plant-based extracts",
    "enzymes, vitamins",
    "trace minerals",
    "amino acids",
    "mycorrhizae bacteria"
  ],
  "instances": [
    "sphagnum peat moss",
    "composted yard waste",
    "manures",
    "worm castings",
    "humic acid",
    "fluvic acid",
    "compost tea",
    "water holding crystals (Soil Moist)",
    "mycorrhizae",
    "bacteria (microbes)",
    "wetting agents"
  ]
},
{
  "term": "bokashi",
  "lang": "en",
  "field": "farming",
  "subfield": "composting",
  "definition": "to ferment food prior to composting using lactobacillus bacteria to predigest waste matter into compost tea and pre-compost",
  "description": "The method involves layering kitchen scraps (vegetables and fruits, as well as meat and dairy scraps) with a bokashi inoculant in a special bucket. Usually, the inoculant consists of either wheat germ, wheat bran, or sawdust combined with molasses and effective microorganisms (EM). The bran/molasses serve as the food for the microorganisms, which are the same natural microorganisms found in soil.",
  "origin": "developed in the early 1980s by Dr. Teuro Higa, a professor at the University of the Ryukyus, Okinawa, Japan",
  "steps": [
    "Chop food waste into 1- to 2-inch pieces. If you add larger pieces, they will take longer to ferment.",
    "About once a day or every two days, add a small sprinkle of bokashi bran, about 1 tablespoon per inch of food waste. Open the bin only to add scraps, not to check on the state of the fermentation. If you add fluffy scraps, press them down to remove the air or put a plate or another flat, heavy object on top of the material to weigh it down to limit oxygen exposure.",
    "Once the bin is full, keep it closed, and let it sit in a warm place for at least two weeks. During that time, drain the bokashi tea every few days. When the bokashi pre-compost is ready and fermented, you don't need to use it immediately. It can sit in the bokashi bucket for longer. During that time, the microbes will go dormant until you use it."
  ],
  "characteristics": [
    "it is a fermentation process",
    "fast",
    "lets you use dairy and meat scraps that are not incorporated in other forms of composting",
    "requires a relatively small space",
    "requires a special airtight bucket or bin with the ability to drain off the liquid that is produced",
    "both the bokashi tea and the pre-compost are highly acidic"
  ],
  "pH": [4.0, 5.0],
  "keywords": ["Japanese", "fermetation", "anaerobic"],
  "notes": [
    "no odors",
    "decreases composting time"
  ]
},

{
  "term": "parasitoid",
  "lang": "en",
  "field": "biology",
  "subfield": "ecology",
  "effects": ["death of its host"],
  "definition": "an organism, typically an insect, that spends a significant portion of its life attached to or within a single host organism, ultimately killing it",
  "notes": [
    "they are distinct from parasites because they inevitably lead to the host's demise, unlike parasites which can live on or in a host without necessarily causing death",
    "the share characteristics with both predators and parasites",
    "some are used in biological pest control"
  ],
  "instances": []
},

{
  "term": "ectoparatisitism",
  "lang": "en",
  "field": "biology",
  "subfield": "ecology",
  "subsubfield": "parasitism",
  "definition": "paralysing the host and living outside it"
},


{
  "term": "plug tray",
  "lang": "en",
  "field": "farming",
  "definition": "a flat, multi-celled tray used in horticulture to start seeds or grow cuttings in individual cells, each containing a small amount of growing medium",
  "benefits": []
},

{
  "term": "hugelkultur",
  "lang": "en",
  "field": "farming",
  "subfield": "organic farming",
  "definition": "a German term meaning \"mound culture\" or \"hill culture\", which refers to creating raised garden beds using wood and other organic materials",
  "description": [
    "the decaying wood acts like a sponge, storing water and releasing nutrients over time to create fertile, self-watering, and self-fertilizing garden beds with improved soil aeration and extended growing seasons",
    "the wood provides a slow, steady release of nutrients as it breaks down, reducing the need for watering and fertilizer"
  ],
  "steps": [
    "large logs and branches are placed at the bottom of the bed, acting as the core structure",
    "the wood is then covered with other compostable materials, such as leaves, grass clippings, and other plant debris",
    "a layer of soil and mulch is added on top, and plants can be grown directly on this surface"
  ],
  "benefits": [
    "water conservation",
    "nutrient release",
    "improved soil",
    "extended growing season",
    "waste reduction"
  ]
},
{
  "term": "heirloom variety",
  "lang": "en",
  "field": "farming",
  "subfield": "organic farming",
  "definition": "an older, open-pollinated plant cultivar of a fruit, vegetable, or flower that has been preserved and passed down through generations, typically for at least 50 years",
  "discussion" : [
    "These plants, often associated with specific families or regions, are valued for their unique qualities, such as distinct flavors, colors, shapes, or hardiness, and are grown from seeds saved each year, which will produce the same type of plant. They represent a significant source of genetic diversity and a connection to agricultural history, in contrast to modern, often hybrid, commercial varieties bred for yield, durability, and marketability."
  ],
  "characteristics": [
    "open-pollinated",
    "true-to-type seeds",
    "age (at least 50 years old)",
    "genetic diversity"
  ],
  "benefits": [
    "unique flavors and traits",
    "hardiness and adaptability",
    "cultural significance",
    "seed saving and adaptation"
  ]
},

{
  "term": "humanure",
  "lang": "en",
  "field": null,
  "definition": "composting human excrement",
  "discussion": [],
  "reasons": []
},
{
  "term": "dry composting toilet",
  "lang": "en",
  "field": null,
  "definition": "a type of dry toilet that treats human waste by a biological process called composting"
},


{
  "term": "aphids",
  "lang": "en",
  "field": "biology",
  "subfield": "zoology",
  "subsubfield": "entomology",
  "description": "soft bodied, pear-shaped insects that suck/feed on plant sap",
  "notes": [
    "aphids are a familiar garden pest and seldom cause major damage",
    "aphids are also a favorite food source of ladybugs, lacewings, and other beneficial insects"
  ]
},

{
  "term": "abiotic stress",
  "lang": "en",
  "field": "biology",
  "definition": "the negative impacts of non-living environmental factors on organisms, particularly plants, leading to reduced growth and yield",
  "instances": [
    "drought",
    "salinity",
    "extreme temperatures"
  ]
},
{
  "term": "drought tolerance",
  "lang": "en",
  "field": "farming",
  "definition": "the ability of living organisms, primarily plants and animals, to survive and thrive during periods of low water availability",
  "mechanisms": [
    "altering cell elasticity",
    "adjusting water potential",
    "entering dormant states to reduce damage from water deficit"
  ]
},
{
  "term": "water potential",
  "lang": "en",
  "definition": "a measure of the potential energy of water in a system, relative to pure water, as determining the direction of water movement",
  "factors": [
    "solute concentration",
    "pressure",
    "gravity"
  ],
  "discussion": [
    "essentially, water moves from areas of high water potential to areas of low water potential"
  ],
  "notes": [
    "measured in units of pressure, such as Pascals or bars"
  ]
},
{
  "title": "nitrogen fixation under water stress",
  "lang": "en",
  "field": "biology",
  "subfield": "botany",
  "discussion": [
    "water stress, or drought, negatively affects biological nitrogen fixation by reducing the rate of nitrogenase activity in legumes and other nitrogen-fixing organisms.",
    "this process can lead to nodule damage and loss of function due to reduced water potential and impaired enzyme activity within the nodules",
    "the severity of the impact depends on the level and duration of stress, but moderate stress often slows fixation, while severe stress can cause complete cessation and irreversible damage, ultimately hindering the plant's ability to fix atmospheric nitrogen"
  ]
},

{
  "type":    "quote",
  "topic":   "purpose of farming",
  "field":   "farming",
  "lang":    "en",
  "author":  "Masanobu Fukuoka",
  "content": "The ultimate goal of farming is not the growing of crops, but the cultivation and perfection of human beings."
},
{
  "name": "Permaculture's Three Ethical Principles",
  "type": "note",
  "topic": "Permaculture's Ethics",
  "field": "permaculture ethics",
  "lang": "en",
  "url": "https://ucanr.edu/blogs/blogcore/postdetail.cfm?postnum=13190#:~:text=Permaculture%20philosophy%20proceeds%20from%20three,self%2Cfamily%2C%20and%20culture.",
  "source": [" Jan Rhoades", "Permaculture: A Gardening Philosophy", "March 19, 2014"],
  "summary": null,
  "content": [
    "Permaculture philosophy proceeds from three ethical principles: Care for Earth, Care for People, Care for Community. Design for anything must be held up to these ethics– care of the earth is the prime goal, the root of sustainability. Care of people is rooted in respect for self,family, and culture. Reinvesting surplus creates equality, as everyone gets their fair share– no one takes more than they need.",
    ""
    ]
},
{
  "name": "Permaculture as a Philosophy",
  "type": "note",
  "topic": null,
  "field": null,
  "lang": "en",
  "url": "https://ucanr.edu/blogs/blogcore/postdetail.cfm?postnum=13190#:~:text=Permaculture%20philosophy%20proceeds%20from%20three,self%2Cfamily%2C%20and%20culture.",
  "source": [" Jan Rhoades", "Permaculture: A Gardening Philosophy", "March 19, 2014"],
  "summary": null,
  "content": "Bill Mollison and David Holmgren, to describe a philosophical approach to living and gardening: permanent culture and permanent agriculture.  What sparked this line of thought was a reaction to the petroleum shortages of the era, food shortages, and the desire for self-reliance.  Combining philosophy and practical application, permaculture encompasses anything from recycling, reusing and regeneration, to simply observing."
}
]
