[
{
  "name": "Anacardiaceae",
  "other_name": [""],
  "nombre": "",
  "genera": [],
  "edible": true,
  "growable": true,
  "description": "Anacardiaceae are resinous trees or shrubs. Leaves are alternate and often trifoliolate or pinnately compound, though some species bear simple leaves. The small, often unisexual, 5-merous flowers have a prominent intrastaminal nectary disk. Fruits are usually 1-seeded drupes. Anacardiaceae comprise more than 700 species in 78 genera. Rhus, the largest genus has 200 species. The family is pantropical but contains some temperate members. Edible members of the family include cashew (Anacardium occidentale), mango (Mangifera indica), and pistachio (Pistacia vera), and hogplums and their relatives (Spondias cytherea, S. mombin, S. purpurea, and S. radlkoferi). Fruits of Schinus molle and Schinus terebinthifolius are used to adulterate black pepper (Piper nigrum). The latter species is an invasive shrub in many parts of the tropics and subtropics. Toxicodendron vernicifluum (lacquer tree) is the source of urushi lacquer. Sap from the unripe fruit of Semecarpus anacardium is used as a dye. Schinopsis quebracho-colorado and several species of Schinopsis Rhus are harvested for tannins. Anacardium, Campnosperma, Dracontomelon, Gluta, Koordersiodendron, Metopium, and Tapirira species provide timber. Species of Metopium, Rhus, Semecarpus, and Toxicodendron are toxic.",
  "includes": ["cashew", "mango", "pistachio", "hogplums"],
  "season_and_temperature": "",
  "planting": "",
  "pests": "",
  "harvest": "",
  "seeds": ""
},

{
  "name": "apiaceae",
  "other_name": ["Umbelliferae"],
  "nombre": "",
  "edible": true,
  "growable": true,
  "description": [
    "Apiaceae are usually aromatic herbs or shrubs with sheathing leaf bases. The simple or compound leaves are alternate. Blades often are deeply dissected. The very small 5-merous flowers have an inferior ovary composed of 2-5 connate carpels. Umbelliferae refers to the characteristic umbellate inflorescence. Fruits are usually dry schizocarps. The cosmopolitan Apiaceae contains 3,780 species in 434 genera. Genera containing more than 100 species include Eryngium (250), Ferula (190), Pimpinella (150), Angelica (110), and Bupleurum (100).",
    "The family, which includes many herbs and spices, medicines, would rank among the ten most important families. Apiaceae are best known as a source of important culinary herbs and spices including anise (Pimpinella anisum), cilantro and coriander (Coriandrum sativum), cumin (Cuminum cyminum), dill (Anethum graveolens), parsley (Petroselinium crispum), caraway (Carum carvi), and cilantro (Eryngium foetidum). Carrots, the tuberous root of Daucus carrota, are one of the world’s top vegetables. Other edible members of the family include celerey (Apium graveolens), fennel root (Foeniculum vulgare), parsnip (Pastinaca sativa) and the Andean crop arracacha (Arracacia xanthorhizza). Most of the edible members of the family also have medicinal value. The family is noted for the presence of bioactive polyactetylenic compounds. Other well-known medicinal plants in the family are dong quai (Angelica sinensis) and gotu kola (Centella asiatica). Poison hemlock Conium maculatum, implicated in the death of Socrates, contains the neurotoxin coniine."
  ],
 "includes": ["carrots", "parsnips", "celery", "parsley", "fennel", "cilantro", "cumin", "dill"],
  "season_and_temperature": "These are cool weather crops that can have two seasons, spring and fall, in most climates. Carrots can withstand a light frost and are often sweeter because of it. It gets so hot in Texas that I decided this year that I’d only grow carrots in the fall because I much prefer their taste when they grow in fall and winter. Members of this family can bolt, or go to seed, with hot temperatures. They have beautiful flowers, so I recommend letting them bloom.",
  "planting": "Most prefer to be direct sown (put in the soil as seeds in the location which they will remain for their life cycle), especially the root crops carrots and parsnips.",
  "pests": "Aphids are the main pest for these plants. Practice crop rotation as a preventive action plan and use a hard spray of water to remove the aphids. While caterpillars ara not all necessarily pests (some are!), I will mention that parsley, dill and fennel are host plants to Swallowtail butterflies. They will devour all of your flowers! I let them at it one season because I loved observing them, so you can decide what you think when the time comes.",
  "harvest": "Most of these plants have leaves that can be eaten when they are young. Just be sure to leave enough leaves for photosynthesis! Carrot and parsnip tops can be seen at the soil level. Check the size to see if they are ready to harvest.",
  "seeds": "Harvest seeds to save from the primary umbel (the first to bloom and the largest) after they have dried on the plant. Also, remember that cilantro seeds are coriander, so you can harvest these to use in your cooking!"
},

{
  "name": "Arecaceae",
  "other_name": [""],
  "nombre": "",
  "edible": true,
  "growable": true,
  "description": [
    "Arecaceae are slender trees or shrubs usually with an unbranched trunk. Notable exceptions to the unbranched trunk are Serenoa and some Euterpe species. The family also includes several genera of climbers. The large, palmately or pinnately lobed, compound leaves are densely clustered at the apex of the stem. They have a well- developed basal sheath. The small trimerous flowers are often unisexual. The gynoecium is usually syncarpous, with 3 carpels united to form a superior ovary. Fruits commonly are fleshy, though sometimes dry, drupes. Palm inflorescences typically are large, branched, and subtended by a spathe. Areaceae includes 2,500 species in 191 genera. The pantropical family is most divers in equatorial regions but also occurs in warm-temperate regions.",
    "Palms have been called the trees of life. Date palms and coconut palms probably have more individual uses than any other species in the world. In addition to those two species, African oil palm (Elaeis guineensis) ranks among the most widely cultivated species. Date palms (Phoenix dactylifera) are among the oldest cultivated tree crops. Today production estimates are as high as 4,000,000 tons of fruits per year. African oil palms can produce 250 kg of quality palm kernel oil and 500 kg of kernel meal per hectare. Coconuts (Cocos nucifera) are symbolic of the multiple uses for which palms can be employed. The hard endosperm of the seed is edible fresh. It can also be dried to produce copra. The liquid endosperm or coconut water is potable. Coconut milk is made by grating coconut with hot water. The fruits also supply food for domesticated animals, especially pigs. Where coconuts are grown in large quantities, non-edible parts of the fruit are used for fuel and are a good source of charcoal. The hard endocarp is used for bowls. Sap from the inflorescence is tapped to produce sugar or it may be fermented to produce an alcoholic beverage. Coir is derived from the mesocarp fibers that surround the seed and is used to manufacture mats, brushes, twine and rope. Coconut leaves are split longitudinally for roof thatch. Baskets, back pats, and hats are woven from the leaf. The plant also is employed in medicines and cosmetics.",
    "In addition to the tree species mentioned above, many other palms are important food sources. Peach palm (Bactris gasipaes) is a major staple for many cultures in Central and Northern South America. In Amazonian Ecuador, the Shuar refer to the palm as uwe, and celebrate its annual harvest with a festival. The doum palm (Hyphaene thebaica) was considered to be a sacred tree in ancient Egypt. Where the sago palm (Metroxylon sagu) grows in Indonesia, it is said “nobody ever goes hungry.” Starch is obtained by soaking pieces of the stem in water. Sugar palm (Arenga pinnata) is the source of jaggery or palm sugar. The apical mersitems of several Euterpe species are among the preferred sources of palm hearts.",
    "Palms also are important fiber sources. For example, Wounaan and Emberá weave baskets from the leaves of Astrocaryum standleyanum. The Seminoles of southern Florida are famous for their dolls, made from the petiole fibers of Serenoa repens. Raphia spp. from Africa are commercially important sources of fiber used for crafts. One of the most valuable non-food palm product is rattan, used a structural material for furniture known by the same name. Rattans are Old World climbers in the genus Calamus and related genera. Species from the New World genus Desmoncus are used similarly. Palms provide a plethora of other products. Carnauba wax is extracted from the leaves of Copernicia cerifera. Phytelephas aequatorialis and other species in the genus are the source of tagua or vegetable ivory. Betel nut palm (Areca catechu) is chewed to produce a stimulating effect due to arecoline and other muscarinic agonistic alkaloids. Palms also have medicinal value. Most notably, saw palmetto (Serenoa repens) is effective in treatment of benign prostatic hyperplasia. Finally palms are highly valued ornamentals, serve as the quintessential symbol of the tropics."
  ],
  "includes": ["date palm", "coconut palm", "oil palm", "betel nut palm"],
  "season_and_temperature": "",
  "planting": "",
  "pests": "",
  "harvest": "",
  "seeds": ""
},

{
  "name": "Brassicaceae",
  "other_name": ["Cruciferae"],
  "nombre": "",
  "edible": true,
  "growable": true,
  "includes": ["broccoli", "Brussel sprouts", "cabbage", "bok choy", "cauliflower", "collard greens", "kohlrabi", "rutabagas", "mustard greens", "nasturtium", "radish", "turnips", "arugula", "kale"],
  "season_and_temperature": "These are cool weather crops that need full sun. In most climates, these can be grown in spring and fall, and many have improved flavor after a frost.",
  "planting": "Most of these will be more successful if started inside around 8 weeks prior to putting them in the garden. Exceptions that prefer to be direct sown include kale, mustard, radish and rutabaga. Though they are generally not grown at the same time anyway, keep away from Nightshades.",
  "pests": "This grouping has many pests. It would be clever to use a row cover such as tulle upon first planting, and then thicker row cover as the temperature drops. Check your plants regularly. If you are having a hard time identifying a pest, bag it and take it sealed to your local garden store to get help identifying it.",
  "harvest": "You can eat some of these when the leaves are young: kale, collards, mustard, Brussel sprouts. Broccoli will have one main broccoli head and then several side shoots will sprout after the main head is developed. You can eat the leaves and flowers of the broccoli plant as well. The flowers of most Brassica are edible.",
  "seeds": ""
},

{
  "name": "Cucurbitaceae",
  "other_name": null,
  "nombre": "",
  "edible": true,
  "growable": true,
  "includes": ["cucumbers", "gourds", "melons", "pumpkins", "squash"],
  "season_and_temperature": "These are warm season crops that require full sun. Interestingly, winter squash grows in the summer in most climates, but it gets its name because the squash can be stored through winter, not because that’s when it grows.",
  "planting": "All of these can be successfully transplanted, but you should take into consideration that they can get root bound. Monitor them so you can transplant them before this happens. Most cucurbits are large plants, many of which are vining and can benefit from a trellis or other support system.",
  "pests": "This family has many pests, including vine borers, squash bugs and cucumber beetles. It is best to observe these plants daily and stay ahead of any potential infestations. If an infestation does occur, the most effective method I have found is to remove the bugs myself and place them in a sealed bag before disposing of them in the trash. They can also get powdery mildew. Be sure to give the plants plenty of air circulation and check the leaves often as a preventive measure. You will see the white mildew on the top sides of leaves. Prune the leaves with mildew during the hottest part of the day, so the plant can heal itself faster. Then, spray the plant with a mixture of about 40% milk to 60% water.",
  "harvest": "For the best flavor, harvest cucumber, zucchini and summer squash young. If you plan to go out of town and don’t have someone coming over to harvest your squash and zucchini, expect them to be enormous when you return! Winter squash and melons need to fully ripen on the vine. Harvesting these can be a bit tricky. Be sure the skin is hard enough that it doesn’t leave a mark when you push your fingernail into it. What helps me the most is to monitor the tendril closest to the fruit. When the tendril is about three quarters brown and rotted, the fruit is ready!",
  "seeds": null
}

]
